[
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Achyuth 540-999-8048 achyuth.java88@gmail.com OBJECTIVE:",
    "length": 56
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Around 8 years of strong software experience in design, development, analysis and deployment of web-based and Client-Server business applications using Object Oriented Analysis and Design (OOAD, OOPS) and Java/JEE/J2EE technologies in Financial, Insurance, and Health Sector Domain with Software Development Life Cycle (SDLC).",
    "length": 326
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "PROFESSIONAL SUMMARY:",
    "length": 21
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Actively involved in each phase of Software Development Life cycle (SDLC).",
    "length": 74
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Expertise in client scripting language and server scripting languages like HTML5, CSS3, JavaScript, JQuery, Ajax, AngularJS, NodeJS, JSON, Bootstrap.",
    "length": 149
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Utilized Java 1.8 features like Lambda expressions and Stream API for Bulk data operations on Collections which would increase the performance of the Application Hands on experience with Amazon web services (AWS) and Amazon cloud technologies such as Amazon EC2 (virtual servers) and Amazon Cloud Watch (monitoring).",
    "length": 316
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Managed Amazon Web Services like EC2, S3 bucket, ELB, Auto-Scaling, SNS, SQS, AMI, IAM, Dynamo DB, Elastic search, Virtual Private Cloud (VPC) through AWS Console and API Integration.",
    "length": 183
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Extensive experience working in Spring framework, Struts framework, ORM Mapping Hibernate framework and web services.",
    "length": 117
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Experience using Spring MVC, Spring Boot, Spring Cloud, Spring DAO, Spring Data, Spring IOC, Spring Annotations, Spring AOP, Spring Transactions and Spring Security.",
    "length": 165
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Experience in developing applications using Micro Services architecture.",
    "length": 72
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Expertise in developing reliable and scalable enterprise applications using Servlets, JSPs, Struts, JSTL, JDBC, AJAX, EJB and Web Services.",
    "length": 139
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Strong work experience in application integration and communicating using SOA, Web Services such as Simple Object Access Protocol(SOAP), Representational State Transfer (REST/ Restful), JAX-RPC, JAX-RS, JAX-WS, WSDL, UDDI, Apache CXF, JAXB, XSD, Axis2.",
    "length": 252
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Excellent knowledge and experience in writing SQL queries, Stored Procedures, Triggers and views using various databases such as MS SQL Server, MySQL, IBM DB2, Oracle databases and NoSQL database systems like Mongo DB.",
    "length": 218
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Expertise in XML technologies such as XSL, XSLT, XML schemas, XPath, XSL-FO and parsers like SAX, DOM.",
    "length": 102
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Experienced in JMS over messaging to exchange the information in more reliable and asynchronous way in enterprise Applications.",
    "length": 127
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Used Apache Active MQ and Apache Camel as JMS provider.",
    "length": 55
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Experience in Creating and configuring the continuous delivery pipelines for deploying Micro services and lambda functions using Jenkins CI server.",
    "length": 147
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Experience in developing logging and standard mechanism based on Log4j and SLF4j.",
    "length": 81
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Worked on implementing full life cycle of software development process (SDLC) in using version control tools like Git, Rational Clear Case, Tortoise SVN, CVS (Concurrent Version System).",
    "length": 186
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Hands-on experience working with Continuous Integration (CI) build-automation tools such as Jenkins along with Build Plugins like Maven, Gradle and Apache Ant.",
    "length": 159
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Experienced in the formation and mentoring of project teams working on Agile methodologies to deliver business critical software applications using tools like Jira.",
    "length": 164
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Experience in web development tools like Eclipse, RAD, Spring Tool Suite, and IntelliJ. Hands on experience with Windows, UNIX and Linux Environments.",
    "length": 150
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Experience in designing, developing, and deploying J2EE applications on IBM Web sphere, Web logic, Apache Tomcat, Glassfish and JBOSS Servers.",
    "length": 142
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "TECHNICAL SKILLS Languages C, C++, Java 1.8, J2EE, SQL and PL/SQL Mark-up/XML Technologies HTML5, CSS3, Bootstrap, JavaScript, jQuery, AJAX, Angular JS, Node JS, XML, XSD, XSL/XSLT, SAX/DOM, DOJO and JSON.",
    "length": 205
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Tools & Framework Struts, Spring, Hibernate, Spring MVC, Spring Web Flow, Spring IOC, Spring AOP, Spring Security, Spring Boot, JSF, JUnit, Apache CXF, SOAP UI, GWT, Jersey.",
    "length": 173
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Build Automation ANT, MAVEN, Jenkins, Gradle.",
    "length": 45
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Web services SOAP, RESTful, UDDI, WSDL, JAX-RPC, JAX-RS, JAX-WS, JAX-B, Micro services, Apache Axis and Apache CFX.",
    "length": 115
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Cloud Technologies Amazon Web Services (EC2, SQS, RDS, IAM, S3).",
    "length": 64
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Web/App Servers Web Sphere, Apache, Apache Tomcat, JBOSS EAP, Web Logic Server and Apache Camel Databases Oracle, SQL-Server 2005, MySQL server, MS SQL, IBM DB2, NoSQL DB like MongoDB IDE tools Eclipse, Net Beans, Spring Tool Suite (STS) and IntelliJ IDEA, RAD Modeling/ CASE Tools Rational Rose and MS Visio Professional.",
    "length": 322
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Testing Tools/ Others JUnit, TOAD, Soap UI, Putty, Rational Clear Quest, RTC, Load UI and Mockito.",
    "length": 98
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Version Control Tortoise SVN, CVS, Rational Clear case, Source Tree and Git. OS & Environment Windows, Linux, UNIX, Mac Design Patterns Singleton, Factory, Prototype, Business Delegate, Session Facade, Service locator, Visitor, Observer, Decorator, Front Controller and DAO pattern.",
    "length": 282
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "PROFESSIONAL EXPERIENCE Client:",
    "length": 31
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Capital One Mar 17 – Till date Location: Mclean, VA Role: Full Stack Java Developer Description : Capital One is the one of largest banking sector, it has over 480,000 members and is among the top 20 credit unions in the U.S.A. Capital One Home Loans servicing is a diversified bank that offers a variety of checking, savings, mortgage and lending accounts and services to individuals, small businesses and commercial clients.",
    "length": 426
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Responsibilities: Involved in the complete SDLC (software development life cycle) of the application from requirement analysis to testing.",
    "length": 138
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Followed Agile Methodology in analyze, define, and document the application, which will support functional and business requirements.",
    "length": 133
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Coordinate these efforts with Functional Architects.",
    "length": 52
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Extensively worked on Responsive Web Design (RWD) page development using HTML5, CSS3, JQuery, JavaScript, AngularJS, and JSON.",
    "length": 126
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Utilized Java 1.8 features like Lambda expressions and Stream API for Bulk data operations on Collections which would increase the performance of the Application.",
    "length": 162
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Used Java 1.8 features in developing the code like Lambda expressions, creating resource classes, fetching documents from database.",
    "length": 131
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Deployed and Monitored Micro Services Using Pivotal Cloud Foundry, also Managed Domains and Routes with the Cloud Foundry.",
    "length": 122
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Designed, Configured and deployed Amazon Web Services (AWS) for a multitude of applications utilizing the Amazon cloud formation.",
    "length": 129
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Experienced in setting up Amazon EC2 instances, virtual private cloud (VPCs), and security groups.",
    "length": 98
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Setting up databases in AWS using RDS, storage using S3 bucket and configuring instance backups to S3 bucket.",
    "length": 109
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Implemented the application using Spring IOC, Spring MVC Framework, Spring Batch, Spring Boot and handled the security using Spring Security.",
    "length": 141
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Developed RESTful API for assessment indicators module and token based authentication for RESTful services using Spring Security.",
    "length": 129
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Involved in building database Model, APIs and Views utilizing Python, to build an interactive web based solution.",
    "length": 113
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Used Jersey to implement Restful Web Service and used XML form to transfer the data.",
    "length": 84
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Developed the application using J2EE Design Patterns like Business Delegate, Factory, Singleton, Session Facade, Service Locator and DAO.",
    "length": 137
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Worked and involved in deployment of core platform technologies, techniques, and web app frameworks such as spring, JBOSS, Tomcat, JSON, XML, HTML5, and Web Services.",
    "length": 166
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Used Spring MVC module to develop MVC Architecture.",
    "length": 51
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Worked on Apache Camel, RabbitMQ for sending messages over queue.",
    "length": 65
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Deployed the Application into Docker container and made easily accessible at runtime using Cloud Foundry and other cloud services like AWS, Netflix Eureka.",
    "length": 155
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Used Spring Security and OAuth2.0 for Authentication and Authorization of the application.",
    "length": 90
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Implemented Spring AOP for declarative transaction management.",
    "length": 62
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Developed a AWS",
    "length": 15
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Lambda function to send a request for internal service end points through API Gateway using apache HTTP Client.",
    "length": 111
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Managed code versioning with GitHub and deployment to staging and production servers Used Rest Controllers to replace the existing operations layer, which acts as bridge between business layer and the UI.",
    "length": 204
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Used Jenkins as build management tool for continuous integration process.",
    "length": 73
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Configured pom.xml to deploy the project using Maven.",
    "length": 53
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Provided Technical support for production environments resolving the issues, analyzing the defects, providing and implementing the solution defects.",
    "length": 148
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Environment : Agile Methodology, Java1.8, Lambda, J2EE, HTML5, CSS3, JavaScript, JQuery, AJAX, AngularJS, Bootstrap, JSON, JSP, AWS, Micro Services, Oracle, RabbitMQ, Spring AOP, Hibernate, Spring Cloud, Spring MVC, Spring JDBC, JDBC, Web-Services, SOA (Service-oriented)",
    "length": 271
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Architecture, Redis, REST, JAX-RS, Jersey, JUnit, JAX-B, WebSphere, JIRA, Maven, GIT, RAD, Jenkins, MongoDB, Cassandra,.",
    "length": 120
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Client:",
    "length": 7
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "State Farm Jan 16 – Feb 17 Location: Dallas, TX Role:",
    "length": 53
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "JAVA Full Stack Developer Description: Auto Quote Purchase (AQP) application is one of the many applications that are part of SF Auto Systems.",
    "length": 142
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Property and Causality being the main forte of State Farm's business the maintenance of all the applications coming under the Auto Systems umbrella is crucial.",
    "length": 159
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Auto Quote Purchase (AQP) is one of the many applications that are part of SF Auto Systems.",
    "length": 91
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "P&C Application support involves production support, defect fixes and minor enhancements based on the SF's requirement.",
    "length": 119
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "AQP is a web application which is used to gather customer information, generate quote and provides options to purchase the Auto policies.",
    "length": 137
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Responsibilities: Involved in SDLC requirements gathering, analysis, design, development and testing of application developed using AGILE methodology.",
    "length": 150
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Created user-friendly GUI interface using HTML5, CSS3, JavaScript, JQuery, AngularJS.",
    "length": 85
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Implemented persistence framework using Hibernate& Handled Transaction Management using the provided data source.",
    "length": 113
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Responsible for designing Hibernate mapping files based on business logic and Object relationships.",
    "length": 99
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Developed restful web service APIs using Spring Framework such as Spring Core, Spring MVC, Spring AOP and Java Persistence API with a backend PostgreSQL and Cassandra database.",
    "length": 176
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Involved in developing Web Services to send XML request and reading the response SOAP UI from Java platform.",
    "length": 108
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Consumed Web Services to interact with other external interfaces to exchange the data in the form of XML and by using SOAP.",
    "length": 123
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Created Restful Web services using Jersey API (JAX-RS) while data exchange was carried out between application and services using JSON.",
    "length": 135
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Spring MVC, Ajax and Dependency Injection for handling presentation and business logic.",
    "length": 87
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "To maintain loose coupling between layers published the business layer as services and injected the necessary dependent components using Spring IOC and published cross cutting concerns like Logging, User Interface exceptions, Transactions using Spring AOP.",
    "length": 256
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Integrated spring and hibernate together and worked on developing backend components and services using Hibernate and spring.",
    "length": 125
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Extensively used HQL and SQL for querying databases.",
    "length": 52
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Developed Message Driven Bean for asynchronous sending Messages using JMS.",
    "length": 74
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Used Apache Camel Framework to transform, extract and load the data.",
    "length": 68
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Used Spring Core Annotations for Dependency Injection and used Apache Camel to integrate spring framework.",
    "length": 106
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Implemented request and response objects using SOAP web services and created routes using Apache Camel.",
    "length": 103
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Used Rest methodology for the service layer interface and used JSON for the data transformation.",
    "length": 96
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Developed various AJAX and JSON calls for the communication between the server and the UI.",
    "length": 90
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Developed web services for produce and consumed the services by making Web Service Calls to remote services in different applications.",
    "length": 134
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Used Spring JMS module for lookup for the queues and MDBs for the listeners",
    "length": 75
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Established Database Connectivity using Hibernate O/R mapping with Spring ORM for MySQL Server.",
    "length": 95
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Developed the Mapping Resource Files for the database entities.",
    "length": 63
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Packaged and deployed the application in IBM Web sphere.",
    "length": 56
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Used IntelliJ as IDE to develop the application and followed the standard features for debugging and running.",
    "length": 109
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Used log4J for application logging and notification tracing mechanisms.",
    "length": 71
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Analysis and Bug fixing of the production problems and defects along with enhancements",
    "length": 86
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Used Rational Clear Case for the version control Used Maven as the build tool.",
    "length": 78
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Used J-Unit Testing and Ant Scripts.",
    "length": 36
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Used JIRA for tracking the Project Stories in AGILE Methodology.",
    "length": 64
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Environment: Agile, Java, JDK, J2EE, HTML5, CSS3, Java Script, JQuery, Ajax, AngularJS, Mongo DB, XML, Spring, Apache Camel, MVC design patterns, Spring MVC, Hibernate, Ant, Maven, Netflix, Rational Clear Case, Web sphere Server, IBM Web Sphere, Apache Camel, SOAP UI, JNDI, Log4J, PostgreSQL, MySQL Server, Google cloud platform, JIRA, RMI, IntelliJ, IDE, LINUX.",
    "length": 363
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Client:",
    "length": 7
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Cigna Healthcare Nov 13– Dec 15 Location: Windsor, CT Role: Java Developer Description: One view is a web based application helping Customer Services people to view Benefit Plan information for Customers, health care providers.",
    "length": 227
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "The application helps to resolve; track customer queries online by reducing overall time.",
    "length": 89
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "The current project is reengineering the old application by replacing outdated Cordiant service layer with Restful Services and Spring Integration frame work improving performance and scalability.",
    "length": 196
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Responsibilities: Designed and developed the REST based Micro Services using the Spring Boot.",
    "length": 93
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Writing end-to-end flow i.e. controllers classes, service classes, DAOs classes as per the Spring MVC design and writing business logics using core java API and data structures Design, develop & deliver the REST APIs that are necessary to support new feature development and enhancements in an agile environment.",
    "length": 312
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Used Spring JMS related MDB to receive the messages from other team with IBMMQ for queuing Developed presentation layer code, using JSP, HTML, AJAX and JQuery Developed the Business layer using spring (IOC, AOP), DTO, and JTA",
    "length": 225
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Developed the Persistence layer DAO using HIBERNATE Worked with Open symphony workflows and delivered work flow module to the client.",
    "length": 133
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Developed the project using industry standard design patterns like Singleton, Business Delegate Factory Pattern for better maintenance of code and re-usability",
    "length": 159
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Developing application module coded on Spring Batch and Apache Camel. Written Jenkins pipeline template script in Groovy programming language for the automation of build and deployment process.",
    "length": 193
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Created groovy scripts to extract transaction volume information and email to management on daily basis.",
    "length": 104
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Developed unit test cases using Junit framework for testing accuracy of code and logging with SLF4j + Log4j",
    "length": 107
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Worked with defect tracking system Clear Quest Worked with IDE as Spring STS and deployed into spring tomcat server, WebSphere 6 & used Maven as build tool",
    "length": 155
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Responsible for code sanity in integration stream used Clear Case as version control tool. Environment: Java, J2EE, HTML, CSS, AJAX, JQuery, MongoDB, Apache Camel, symphony, JavaScript, JSP, Spring, Spring Batch, Spring web services, XML, UML, JUNIT, IBM WebSphere, Maven, Clear Case, SoapUI, Oracle 11g, Spring JMS, IBM MQ.",
    "length": 324
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Client:",
    "length": 7
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Liberty Mutual Jan 12 - July 13 Location: Seattle, WA Role: Java Developer Description: Liberty Mutual Insurance is an American diversified global insurer, and the second-largest property and casualty insurer in the United States.",
    "length": 230
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Ecommerce application provides services such as Auto Insurance and home insurance.",
    "length": 82
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "The application is used for accessibility into the appropriate Agent Center applications and generating quotes and policies, payments and reports.",
    "length": 146
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Responsibilities: Involved in all phases of the Software development life cycle (SDLC).",
    "length": 87
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Designed project related documents which includes Use case, Class and Sequence diagrams.",
    "length": 88
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Involved in design, development, testing and implementation of the process systems, working on iterative life cycles business requirements, and creating Detail Design Document.",
    "length": 176
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Using Agile methodologies to plan work for every iteration and used continuous integration tool to make the build passes before deploying the code to other environments.",
    "length": 169
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Extensive experience in developing PL/SQL Stored Procedures, Functions, Packages, Cursors, Collections (Nested tables and arrays), Records, Object types and Database Triggers.",
    "length": 175
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Created HTML Wireframes based in the Detailed System Specification Document Developed the presentation layer of the application using MVC architecture of spring framework.",
    "length": 171
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Created DAO classes to interact with DB2 database.",
    "length": 50
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Used Spring ORM module to integrate with Hibernate.",
    "length": 51
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Used JMS API for sending and receiving the messages on the queue.",
    "length": 65
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Used the spring validation and Tiles Framework in the presentation layer.",
    "length": 73
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Developed user interface using JSP, Spring Tag Libraries to simplify the complexities of the application.",
    "length": 105
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Developed user interface with Java Server Pages, Ajax support to speed up the application form filling.",
    "length": 103
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Used Apache Axis as the Web Service framework for creating and consuming Web Service clients using SOAP and WSDL.",
    "length": 113
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Used Rally for tracking purpose.",
    "length": 32
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Designed various tables required for the project using DB2 database.",
    "length": 68
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Used JBOSS server for deploying the application.",
    "length": 48
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Used Ant for build, create JAR, WAR, EAR files and deploy the EAR files automatically.",
    "length": 86
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Used Junit to test the application classes.",
    "length": 43
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Used Log4J to capture the logging information.",
    "length": 46
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Environment: Java, J2EE, JavaScript, JSP, AJAX, XML, Agile, Spring, Eclipse IDE, DB2, Rational Rose, Log4j, Junit, Ant, JBOSS, Rally, Apache Axis, Web Service, SOAP, WSDL.",
    "length": 171
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Client:",
    "length": 7
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Soft Pro Systems Ltd.",
    "length": 21
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Sep 10 - Dec 11 Location: Hyderabad, India Role: Java Developer Description: This project is mainly an Intranet application meant for employees in the organization.",
    "length": 164
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "They are Intranet mailing System, Chatting, File Transfer and Remote Login.",
    "length": 75
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "This project is based on the client server methodology.",
    "length": 55
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Responsibilities: Involved in the design and development of an entire Module – Guided Set Up.",
    "length": 93
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Developed user interface through JSP and Servlets.",
    "length": 50
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Developed Action classes and Action Forms using the struts framework.",
    "length": 69
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Developed Customs tags to display dynamic contents and to avoid large amounts of java code in JSP pages",
    "length": 103
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Connected to database through JDBC.",
    "length": 35
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Extensive experience working with XML (DOM and SAX).",
    "length": 52
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Used SQL-server to store the items in the database.",
    "length": 51
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Used Session beans for navigation of steps.",
    "length": 43
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Used Entity beans for storing the database in to database.",
    "length": 58
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Developed Session Beans as the clients of Entity Beans to maintain the Client state.",
    "length": 84
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Developed Ant Scripts to build and deploy EAR files on to Tomcat Server.",
    "length": 72
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Analyzed the EJB performance in terms of scalability by various Loads, Stress tests using Bean- test tool.",
    "length": 106
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Extensively used Eclipse while writing code as IDE.",
    "length": 51
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Written complex SQL queries, stored procedures, functions and triggers in PL/SQL. Developed test cases and used Junit for Unit Testing.",
    "length": 135
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Used CVS for version controlling.",
    "length": 33
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Environment: Java, J2EE, Servlets, XML (DOM and SAX), JSP, EJB, JavaScript, CSS, JDBC, Struts, Ant, Web Logic Application Server, WSAD, Eclipse IDE, SQL-Server, Apache Tomcat, Oracle, PL/SQL, CVS, PVCS, Junit, Windows.",
    "length": 218
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Client:",
    "length": 7
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Login IT Technologies May 09 - Aug 10 Location: Hyderabad, India Role: Java Developer Description: PRS or Price reporting system is responsible to publish the rates to the customers and as to maintain the users across the FedEx locations and its subsidiaries.",
    "length": 259
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "It interacts with the customer fusion and existing legacy systems to access the customer information and legacy data. Responsibilities: Developed web application using Struts 2.X, JSP, Servlets, Java beans that uses MVC design pattern Created user-friendly GUI interface and Web pages using HTML, CSS and JSP",
    "length": 308
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Wrote JavaScript for client-side validation.",
    "length": 44
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Used Eclipse as IDE tool for creating Servlets, JSP, and XML.",
    "length": 61
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Wrote SQL for JDBC prepared statements to retrieve the data from database.",
    "length": 74
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Monitored the logs using Log4J and fixed the problem",
    "length": 52
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "The application was deployed on the Tomcat.",
    "length": 43
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Involved in build and deploying the application using ANT",
    "length": 57
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Used CVS as version control system",
    "length": 34
  },
  {
    "file": "Achyuth Resume_8.pdf",
    "sentence": "Worked on bug fixing and Production Support Environment: Java, JDBC, Struts, JavaScript, HTML, CSS, JSP, Servlets, Tomcat, Oracle, Eclipse IDE, CVS, ANT, Log4J.",
    "length": 160
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Krishna Sr. Business Systems Analyst S U M M A R Y IT professional with over 6+ years of Industrial experience in Insurance and Digital Marketing.",
    "length": 146
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Possess effective Communication, analytical and problem-solving skills with Creative Implementation Techniques.",
    "length": 111
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Highly skilled professional with industrial experience on standard Software Development Life Cycle (SDLC) methodologies like Waterfall, Scrum, Kanban and Waterfall-Scrum Hybrid and have decent understanding on Rational Unified Process.",
    "length": 235
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Proficient in Stakeholder Analysis, Impact Analysis, Risk analysis, Change Management, Dependency Management, Conflict Management Cost-Benefit Analysis and Gap Analysis includes AS-IS and TO-BE analytical techniques.",
    "length": 216
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Seasoned in facilitating Scrum Ceremonies including User Story Workshops, Daily Scrum, Sprint Planning, Sprint Review, Sprint Retrospective and Backlog Refinement meeting.",
    "length": 171
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Skilled scrum master with excellent understanding on Scrum processes, Scrum roles and Scrum Artifacts.",
    "length": 102
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Well versed in facilitating time-boxed scrum ceremonies like Sprint planning meeting, daily standup meeting, sprint review meeting and sprint retrospective meeting for every sprint.",
    "length": 181
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Worked with Program management and value stream levels to help decompose EPICS and Features into small user stories pertaining to INVEST criteria and SMART criteria for tasks.",
    "length": 175
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Coached multiple scrum teams within the organization to follow best Agile practices, conducted workshops along with Agile coach to define best practices and conduct story writing workshops.",
    "length": 189
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Worked in SAfe environment at program level as a scrum master and maintained multiple teams tracked the teams progress and used time management techniques.",
    "length": 155
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Performed Business Process Modelling (BPM), Analysis & Re-engineering and providing solutions for issues relating to Risk management and Solution Management processes for better and efficient decision making in time.",
    "length": 216
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Expertise in User Experience (UX) designing, Mockups, Wire Frames, Prototypes and Power Point Presentation.",
    "length": 107
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Expertise in gathering and managing Requirements and tracked defects working with Jira, Rally (CA Agile), SharePoint Enterprise 2016, HP Application Lifecycle Management (HPALM) and HP Quality Center (HPQC).",
    "length": 207
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Proficient in conducting and facilitating Joint Application Design (JAD) sessions and interviews, brainstorming sessions, questionnaire, Document analysis, focus group, workshops, and Status Demo sessions.",
    "length": 205
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Decent exposure to the mobile application process and integration strategy.",
    "length": 75
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Proficiency in gathering requirements and transforming them into Functional and Non-Functional specifications.",
    "length": 110
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Proficient in Object Oriented Analysis (OOA) and well acquainted with workflows and Unified Modeling Language (UML) diagrams including Use Cases, Activity charts, Sequence diagrams, ER diagrams and Data flow diagrams (DFD’s) using Rational Rose and MS-Visio thus assisting development team in preparing Business Process Model.",
    "length": 326
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Extensive experience in drafting and analyzing Request for Proposal (RFP) and Request for Information (RFI), Business Requirements Document (BRD), Functional Specification Documents (FSD), Software Requirement Specifications (SRS), Use Case documentation and Requirement Traceability Matrix (RTM)",
    "length": 296
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Acquainted with Relational Database Management systems (RDBMS), Meta Data Analysis programmed SQL Queries, business logics, Stored Procedures and exposure to various databases and modelling techniques.",
    "length": 201
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Expertise in creating ER Diagrams with Conceptual Data models, Physical Data models by capturing the requirements.",
    "length": 114
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Extensive knowledge on Data Warehousing architecture, Implementation approaches, schemas, dimensional modeling, Data Marts, Rapidly and Slowly Changing Dimensions, OLAP Cubes operations, and able to perform Reverse Engineering Analysis interpreting the business requirements and identify the source systems.",
    "length": 307
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Proficient in drafting Data Dictionaries, Data Mappings and identifying various Transformations ensuring the Data Integrity.",
    "length": 124
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Extensive experience over ETL (Extract Transform Load) process in Data Integration, Data Migration and Data Warehousing using Informatica Power Centre, IDQ (Data Quality) and SSIS-SSAS-SSRS with planning strategies and Management.",
    "length": 230
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Comprehensive understanding of Three-Tier Architecture and Service Oriented Architecture (SOA), Web Services, APIs, REST & SOAP using XML, JSON, WSDL and UDDI, with internet protocol suites like HTTP/HTTPS and FTPS.",
    "length": 215
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Decent exposure with Administration, configuration, Implementation, and Data Loading process, Application Integration in Salesforce CRM, SOQL and SOSL querying and Application development with Apex and visual force.",
    "length": 215
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Extensive experience in Declarative approach of Development by designing Custom Applications, Objects, Fields, Access Matrix ensuing the Data Security ( at Object level, Field level and Record level), Org Wide Default (OWD) rules, profile management, page layout, search layout, Import wizard, ER diagramming and Dependency identification, licensing, Permission Sets, Email Templates, Automation of Outbound Message and emails, Role Based Page Layouts, Workflow Alerts and Actions, Validation Rules, Approval Processes, Field mapping, Custom Tabs, Custom Reports, Report Extractions to various formats, Audit Trail, Snapshots, Dashboards , Approval Flow Diagrams.",
    "length": 663
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Proficient in Technical Writing and API testing using SOAP UI 4.5, Swagger and Postman 4.8.0.",
    "length": 93
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Well versed with Cloud Technologies like SaaS-PaaS-IaaS (Software-Platform- Infrastructure as a service).",
    "length": 105
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Collaborate with Software Quality Assurance Team and well versed in conducting various testing like Functionality testing, System Testing, Performance Testing and User Acceptance Testing (UAT) and helped in developing test plans & test scenarios.",
    "length": 246
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Expert in preparing Training manuals, Project Implementation Materials and Standard Operating Procedures.",
    "length": 105
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "T E C H",
    "length": 7
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "A L S K I L L S Regulatory-Compliances Dodd-Frank Act-",
    "length": 54
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Consumer Protection Act, Workforce Investment Act, Health Information Privacy Model Act, and Risk Management & Own Risk and Solvency Assessment Model Act, PCI DSS, Fair Trading Act.",
    "length": 181
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Insurance, E-commerce Claim Management, Quotation Management, Billing Management, Policy Centre, Risk Exposures, Premium Calculations, Commercial and Personal Insurances, Unemployment Insurance, Life Insurance, Health Insurance, Property & Causality Insurance, Payment Verifications, Order Management.",
    "length": 301
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Salesforce (Sales/Service/Marketing) Outbound Messages, Workflow Approvals, Field updates, Reports, Custom Objects, Apex Language, Apex Trigger, Visual force Page, Component Controllers, SOQL, Apex Data Loader, Force.com Excel Connector and Force.com Eclipse IDE Plug-in.",
    "length": 271
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Requirements Management JIRA, RALLY (CA Agile), HP ALM 11.5 Collaboration Platforms Confluence, Microsoft SharePoint, IBM Lotus.",
    "length": 128
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Reporting Tools IBM Congos, Power BI, SSRS, ArcGIS, Tableau Office Tools MS Word, MS Excel, MS PowerPoint, MS Project, MS Visio, MS SharePoint 2013 Testing Tools HP QC, Selenium, Load runner, Cucumber, SOAP UI 4.5, Swagger, Postman 4.8.0.",
    "length": 238
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "ETL Tools INFORMATICA Power Centre, SSIS -SQL Server Integration Service, SSAS Languages and Web Elements HTML, SQL, CSS, JS, Python, Angular JS, XML, JSON, SOA, WSDL 2.0, UDDI, APIs and SLA.",
    "length": 191
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Databases MySQL, Postgre SQL, IBM DB2, Oracle 11g Modelling & Designing tools CA ERwin 9.5, MS Visio, Rational Rose, Smart Draw Defect Tracking tools Jira, HP Quality Centre, Team Foundation Server E D U C",
    "length": 205
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "I O N Bachelor of Technology - Jawaharlal",
    "length": 41
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Nehru Technological University Aug 2008-May 2012 Master of Science -University of New Haven Jul 2016-",
    "length": 101
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "May 2017 P R O F E S S",
    "length": 22
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "A L E X P E R I E N C E 1.",
    "length": 26
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Germania Insurance, Brenham, TX Sr. Business Systems Analyst Feb 2017-",
    "length": 70
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Till date The aim of the project to develop an Enterprise Level Information Intelligence System and there by integrate with Duck Creek Suit (Insights) and Salesforce CRM , which enables Risk Management Team, Actuaries and Decision Support Systems to perform Consolidated Geo-Special Analysis which helps in Managing the Risk in multiple line of business like Life Insurance, P&C Insurance for both Personal and Commercial policies and taking appropriate decisions in time further provides competitive advantages in Policy Pricing, Underwriting, Risk Exposure management, Catastrophic management, financial survival and Reinsurance Planning. ROLES & RESPONSIBILITIES:",
    "length": 666
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Assisted the project managers in developing project plan that included Project Schedules, Milestones tracking, and Meeting minutes using MS Project.",
    "length": 148
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Created Business Process Workflow diagrams of Current and Expected System, using MS Visio and makes sure that both business and technical teams understand the process.",
    "length": 167
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Elicited business requirements by conducting JAD sessions, Interviews, Focus Groups and Brain Storming sessions.",
    "length": 112
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Drafted and Managed Business Requirement Document (BRD) and Functional Requirement Specifications (FRS) in Share Point Enterprise 2016 and led the Requirement Workshops where the specifications get converted into User Stories and determining the Acceptance Criteria as per the requirement.",
    "length": 289
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Created and maintained Requirement Traceability Matrix (RTM) correlating the system requirements to functional- nonfunctional requirements and then to test cases.",
    "length": 162
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Provide Product Owner Support in grooming, analyzing, prioritizing, and breaking down into User Stories.",
    "length": 104
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Worked closely with Data Analyst Team and assisted in assuring the integrity of the collected data.",
    "length": 99
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Analyzed and drafted Service Detailed documents from Web Service Description Language (WSDL).",
    "length": 93
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Co-ordinated the Quality Assurance teams in Application Programming Interfaces (APIs) testing using Postman 4.8.0 and assisted in Technical Writing Workshops.",
    "length": 158
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Provided the support in developing RESTFUL API in JSON format using JAVA.",
    "length": 73
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Assisted Software Quality Assurance Team with Test Plans, Test scenarios and Test cases for APIs and webservices.",
    "length": 113
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Proactively defined Reporting-Business Rules for Business Intelligence Analysts to expand on KPI metrics.",
    "length": 105
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Worked on Relational Database Management systems (RDBMS), programmed SQL Queries, Metadata Analysis and documented Data Dictionaries and Data Mapping Artifacts.",
    "length": 160
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Assisted Software Quality Assurance Team with Test Plans, Test scenarios and Test cases.",
    "length": 88
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Involved in System Integration Test Planning, Test Preparation, Test Execution and Issue Resolution and Report Generation to assure that all aspects of a Project are in compliance with the Business rules.",
    "length": 204
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Facilitated the Pre UAT (User Acceptance Testing) and UAT; assisted in testing and maintaining quality procedures such as Black box and Regression testing; created all the relevant documents for appropriate users.",
    "length": 213
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Created User Manuals with detailed list of parameters and system responsive screen shots.",
    "length": 89
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Environment: Waterfall-Scrum Hybrid, Duck Creek Suit, TDD, Eclipse Mars 4.7, ArcGIS Enterprise 10.3, Share Point Enterprise 2016, JIRA, MS Visio, MS Project, SOA, RESTful, JSON, XML, Informatica Power Centre, IDQ, Postman 4.8.0 - API Testing, Oracle 11g, AWS, SaaS (Software as a Service), PaaS, MS Office tools (MS Word, MS Excel, MS PowerPoint), MySQL Workbench.",
    "length": 364
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Sun Life Financial, Boston, MA Business Analyst/ Scrum Master Jul 2015-Feb 2017",
    "length": 79
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "The project was to completely migrate the Legacy CRM Application on the Premises to the Salesforce CRM to reduce its footprint and overhead costs that comes up with infrastructure maintenance.",
    "length": 192
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "As part of this vision, the organization wanted to create a client facing mobile application and then integrate with the Enterprise Service Bus(ESB) with in a Service Oriented Architecture (SOA).",
    "length": 195
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "ROLES & RESPONSIBILITIES: Elicited business requirements for the project using interviews, document analysis, surveys, site visits, use case scenarios and used standard template of the organization to develop requirements.",
    "length": 222
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Gathering the requirements from the analyzed stake holders and create User Stories and determine Acceptance Criteria.",
    "length": 117
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Facilitated Time-boxed Scrum Ceremonies, tracked team’s performance and scope creep using sprint burn-up/burn- down charts, designed internal reports to track team progress with respect to every sprint.",
    "length": 202
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Identified and maintained consistent Sprint velocity and capacity during Sprint planning meeting using metrics related to optimal velocity, average velocity, team velocity and focus factor.",
    "length": 189
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Coached development team to create clear and concise product backlog items in terms of estimating the size of the stories using techniques like Planning Poker, T-Shirt Sizing, Relative Mass valuation.",
    "length": 200
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Facilitated Sprint Review Meetings by involving external stake holders and business sponsors to present a demonstration of potential shippable product increment (PSPI) after each sprint.",
    "length": 186
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Resolved Impediments within the development team, identified and resolved external impediments by communicating with stakeholders from external teams to achieve sprint goal.",
    "length": 173
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Created User Stories and led the Planning Poker game to estimate them in Sprint Planning and Backlog Grooming meetings.",
    "length": 119
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Worked with Product Owner to prioritize User Stories based on Business Value using MoSCow and Kano techniques.",
    "length": 110
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Gather the acceptance down time windows from System Traffic Reports and assist the project management team in Batch processing and Migration Strategy.",
    "length": 150
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Responsible for Stakeholder Analysis, Managing the requirements creating UML diagrams (Use Cases, Activity Diagram and Class Diagram) to capture and represent the dynamic behavior of different applications.",
    "length": 206
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Provided Administrative Support and created Custom objects, fields- Leads, Marketing, Campaign, Dashboard, Sales, and Account for Salesforce.",
    "length": 141
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Configured security and organizational hierarchy for sales for salesforce implementation.",
    "length": 89
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Involved in Design and development of Workflows rules, Testing, triggers, validation rules and customizations with Salesforce, Configured Reports for custom objects and associated them to Dashboard.",
    "length": 198
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Created UX wireframes and Mock screens for Mobile application and assisted in cross browser/ cross platform testing.",
    "length": 116
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Assisted as an SME for designing mobile application requirement gathering and integration strategy.",
    "length": 99
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Customized page layouts for Salesforce standard and customized workflows, Approval process, objects, Dashboards, Out bound messaging services, Exception to OWD (Org wide Defaults) as per the requirement.",
    "length": 203
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Drafted Data Dictionaries, Data Mappings Artifacts and identified various Transformations required.",
    "length": 99
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Involved in the System Integration Testing (SIT), and perfumed Work Flow- Functionality testing validated Test reports.",
    "length": 119
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Worked on API Documentation and Technical Writing and supported ESB Integration Team on SOA.",
    "length": 92
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Facilitated the Pre UAT (User Acceptance Testing) and UAT; assisted in testing and maintaining quality procedures such as Black box and Regression testing; created all the relevant documents for appropriate users.",
    "length": 213
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Environment: Waterfall-Scrum Agile-hybrid, JIRA, Confluence, MS project, MS office Tools (Word, Excel, PPT and Visio), Salesforce CRM, SaaS (Software as a service), APEX, Data loader, Visual force, Webservices, Red Hat Mobile Application Platform, Force.com IDE, Mule soft ESB, SOA, Guidewire Suit, XML, Tableau, WSDL, SOQL.",
    "length": 324
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Alaska DOLWD, Anchorage Sr. Business Systems Analyst Feb 2014-Jun 2015",
    "length": 70
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "The aim of project was to build an upgraded Data Warehouse System for Workforce Development Department, by extracting data from heterogeneous databases.",
    "length": 152
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "The resulted data system comprised a single repository for data records spanning the full range of workforce systems, including unemployment insurance, apprenticeship training and the One-Stop Career Centers, enabled with better enhanced analysis, financial surveillance, budget allocation, expenditure tracking and consolidated reporting capabilities. ROLES & RESPONSIBILITIES: Perused and finalized the ready ness of Request for Proposals (RPF) and assisted the Project Management Team in creating Response Documentation, Project Charters.",
    "length": 541
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Facilitated JAD sessions as Moderator and conducted interviews, focus groups with various Subject Matter Experts (SMEs) and stakeholders, process reviews and policy & procedure reviews to elicit requirements.",
    "length": 208
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Proactively participated in LAND SCAPE Analysis to identify the GAP between the current and expected system.",
    "length": 108
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Prepared Business Requirement Document (BRD/HLD) and assisted preparation of System Requirement Specification (SRS).",
    "length": 116
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Further Analyzed, modified and validated requirement artifacts.",
    "length": 63
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Used Reverse-Engineering techniques to be identified the missing sources and attributes.",
    "length": 88
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Created Business Use Cases and built Use Case Diagram and Activity Diagram using Smart Draw.",
    "length": 92
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Collaborated with the Data Architects in Designing & Modelling the Targeted Data Bases.",
    "length": 87
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Highly involved in Dimensional Analysis, Meta Data Analysis, System Catalog Analysis and created Data Dictionaries.",
    "length": 115
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Assisted Data modeling process by creating conceptual and logical ER diagrams and designing database schemas to help development of an accurate Data Warehouse Structure.",
    "length": 169
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Assisted in Source Data Analysis and Extraction Strategy using SSIS as an extraction and integration platform.",
    "length": 110
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Created Data Dictionaries and Data Mapping Documents (S2T Artifacts) with all the required transformation logics.",
    "length": 113
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Worked with QA team to design and develop Test Plan and Test Cases to perform User Acceptance Testing (UAT), Functional Testing and Regression Testing.",
    "length": 151
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Assisted in Strategical Planning for Data Integrity, Data quality and adding Data Verification and Validity to maintain accuracy and effectiveness of data. Involved with Business Intelligence (BI) team creating report catalogs and required parameters as per the requirements.",
    "length": 275
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Query Multiple Data bases PostgreSQL, MS SQL with SQL queries and documents the analysis reports.",
    "length": 97
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Collaborated with in Test Planning, Test Preparation, Test Execution and Issue Resolution and Report Generation to assure that all aspects of a Project are in Compliance with the Business Requirements Experienced in Logging and tracking the defects using HP Quality Center.",
    "length": 273
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Created an error repository and managed the testing process with the QA team",
    "length": 76
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Worked with BI team in creating the Training Manuals with Standard Operational Procedure.",
    "length": 89
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Helped the end users getting accustomed to the system by live demonstrations and system tutorials.",
    "length": 98
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Environment: Waterfall, MS Office suit, SSIS_SSAS_SSRS, MS VISIO, MS Project, MS TFS, DWH Architecture, SharePoint, Erwin 9.5, MS SQL, POSTGRE SQL, Main frames.",
    "length": 160
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "4. Grange Insurance, Columbus, OH Business Systems Analyst Nov 2012-Dec 2013",
    "length": 76
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "The client is one of the leading providers of P&C and life insurance service.",
    "length": 77
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "The project was about creating an application on the salesforce platform that tracks the customers interests searches on the Enterprise web site and connect it to CRM System data, so that the Marketing Management Team can pay attention to their prospect’s interests.",
    "length": 266
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "ROLES & RESPONSIBILITIES:",
    "length": 25
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Interacted with users and stakeholders to identify business needs, evaluated solutions for business problems.",
    "length": 109
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Conducted Joint Application Development (JAD) sessions and Requirement Workshops (RW) with Subject Matter Experts.",
    "length": 114
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Configured Data security and Organizational hierarchy for Org salesforce implementation.",
    "length": 88
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Customized page layouts, custom objects, fields, Dashboard, Sales, and Account.",
    "length": 79
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Involved in Design and development of Workflows rules, triggers, validation rules and customizations with Salesforce.",
    "length": 117
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Administered Salesforce CRM applications for Sales, Marketing and Support Departments.",
    "length": 86
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Responsible for all the activities related to configuring Import Wizards, r.io, uploading data in CSV files into salesforce.com, checking for integrity of the data.",
    "length": 164
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Set up visibility securities like roles, profiles, field level securities.",
    "length": 74
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Created and maintained Data Mapping Documents and Data Lineage Designs in MS Excel and MS Visio.",
    "length": 96
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Designed and developed all Use Cases and UML models using MS Visio.",
    "length": 67
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Assisted in designed Test Plans, Test Cases for Functional Testing, Load Testing and User Acceptance testing (UAT) and assisted Quality Assurance Teams in tracking the issues.",
    "length": 175
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Provided the sophisticated user manuals and training material to the marketing team to create Product Demo videos. Environment: AGILE Scrum, Guidewire Insurance Suit, SOA, SaaS (Software as a service), MS project, MS office Suit, MS Project, MS Visio, Angular JS (SPA), IBM Web Sphere (Java application), Eclipse IDE Juno 3.8, Load Runner 11.5, Rally ALM, Apex Data Loader, Workflow Approvals.",
    "length": 393
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "5. Birla Sun life Insurance, Hyderabad Business Systems Analyst/ UX support Feb 2012-Oct 2012",
    "length": 93
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "The project was to develop Highly Responsive Pages (HRP) and mount them on the Enterprise website with detailed demos of Improved Business Process of an Insurance Company.",
    "length": 171
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "And further location of Visitors and details are tracked and connected to the existing CRM system which helps the Organization to transform their Prospects into Potential customers.",
    "length": 181
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "ROLES & RESPONSIBILITIES:",
    "length": 25
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Worked with Subject Matter Experts, Digital Marketing Analyst, Project Managers and Business Owners to understand the business process gather Business Requirements and identified enhancements.",
    "length": 192
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Conducted various sessions like JAD Sessions, Brain Storming and Focus Groups for eliciting pragmatic requirements.",
    "length": 115
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Drafted and Managed User Stories and Features and Create User Story Dependency Matrix and Story mapping artifacts.",
    "length": 114
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Developed Mock Screen and Wire Frames and presented as DEMO session to the Primary Stakeholders.",
    "length": 96
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Translate concepts into user flows, wireframes, mock-ups and prototypes that lead to intuitive user experiences.",
    "length": 112
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Served as a liaison between business team and the UI team by assisting the business in identifying, understanding their intended look and Design of the Pages.",
    "length": 158
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Used Photoshop and Balsamic extensively to develop Designs and frames models.",
    "length": 77
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Collect and manage User Experience Reports/feedbacks of the former and competitor UX reports.",
    "length": 93
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Prepare Customer Analysis Reports based on the Targeted Demographics and Previous Transactions.",
    "length": 95
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Communicating scenarios, end-to-end experiences, page layouts and Screen Designs with Cross Functional Teams.",
    "length": 109
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Conduct usability tests on each independent page on the website and show case the reporting to the stakeholders.",
    "length": 112
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "To automate Cross Browser and Cross Platform testing used Selenium Testing Framework for automated Web application testing and auto scripting.",
    "length": 142
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Responsible for meetings with users and stakeholders to identify problems, resolve issues and improve the process to ensure the system meets all the goals of the project.",
    "length": 170
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Produced visual models for the application using UML MS Visio to create Use Cases, Sequence Diagrams.",
    "length": 101
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Collaborated and negotiated with stakeholders in defining project scope boundaries.",
    "length": 83
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Environment: SCRUM, MS Visio, Adobe Photoshop, Balsamic, Cloud- SaaS, MS Office Suite, AJAX Framework, Selenium Testing Framework, POSTGRE SQL, Apache Tomcat, Outlook, CRM Systems.",
    "length": 180
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "SUMMARY TECHNICAL SKILLS EDUCATION PROFESSIONAL EXPERIENCE 1.",
    "length": 61
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Germania Insurance, Brenham, TX Sr. Business Systems Analyst Feb 2017-",
    "length": 70
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Till date 2.",
    "length": 12
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Sun Life Financial, Boston, MA Business Analyst/ Scrum Master Jul 2015-Feb 2017 3.",
    "length": 82
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Alaska DOLWD, Anchorage Sr. Business Systems Analyst Feb 2014-Jun 2015 4.",
    "length": 73
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Grange Insurance, Columbus, OH Business Systems Analyst Nov 2012-Dec 2013 5.",
    "length": 76
  },
  {
    "file": "Krishna_BSA.pdf",
    "sentence": "Birla Sun life Insurance, Hyderabad Business Systems Analyst/ UX support Feb 2012-Oct 2012",
    "length": 90
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Instructions for preparing your “Resume” Nandini Email : JNandini1324@gmail.com :",
    "length": 82
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "+1 6463611031 Profile Professional Summary Decisive, action-oriented and results-focused professional offering around 10+ years of work experience in IT industry with last 4 years focused on Technical Project Manager managing of about 20 + resources and Over 6 years of technical experience centering on Middleware tool webMethods.",
    "length": 331
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "My skill set is mainly divided into 2 areas: Technical Project Management and web Methods /Oracle B2B technical experience.",
    "length": 123
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Management Experience (Onsite) Experience in Technical Delivery, Team Leadership and Onsite-Offshore Delivery.",
    "length": 110
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Proven ability to manage and deliver large, complex projects on time & on budget.",
    "length": 81
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Handled 3 to 4 projects (management and technical) at same time integrating different middleware technologies ( webMethods, Oracle SOA, Informatic and Dell Boomi projects)",
    "length": 171
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Ensure software development process is followed (evaluate, specify, estimate, develop, test and deploy) within budget and timescale",
    "length": 131
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Been as client relationship manager (setting expectations, harvesting new work, customer satisfaction and providing value add services)",
    "length": 135
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Project Management: controlling and monitoring timelines, resource allocation, budgets, project costs and quality of deliverables",
    "length": 129
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Project Initiation: project commencement tasks including participating in contract reviews, commercial arrangements, kick-off meetings, etc Worked in UK for 3 years at client location as a Project Manager initially and later promoted to Client Delivery Manager.",
    "length": 261
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Currently working from client location at US as Technical project manager, managing overall delivery of multiple projects and providing technical support.",
    "length": 154
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Technical Experience : Have 6 years of knowledge of Software AG webMethods 8.x / 9.x product suite (Integration Server, MWS, Broker).",
    "length": 133
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Expertise in the areas of developing with Service Flows, Adapter Connections (JDBC, SAP ) , SOAP/REST web services.",
    "length": 115
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Worked on Trading Networks configurations and setup (AS2- EDI, EDIFACT, XCBL) in webMethods.",
    "length": 92
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Have 6 months of experience in Oracle B2B partner configuration and creating document types ( X12, EDIFACT, XCBL, Custom documents).",
    "length": 132
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Education Master of Science (M.S) in Software Engineering from BITS Pilani, work integrated program from Mahindra Satyam, with an aggregate of 80% in July 2010.",
    "length": 160
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Bachelor of Technology (B. TECH) in Electronics and Communication from JNTU, Hyderabad with an aggregate of 78% in April 2007.",
    "length": 126
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Achievements",
    "length": 12
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Received client appreciations for outstanding performance.",
    "length": 58
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Achieved 100% maintenance support satisfaction from the customers.",
    "length": 66
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Employment Summary Technical Project Manager at Tech Mahindra Limited from June 2007 to till date .",
    "length": 99
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Program Details: GE HEALTHCARE is a member of the General Electric group of companies.",
    "length": 86
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "GE HEALTHCARE provides transformational medical technologies and services that are shaping a new age of patient care.",
    "length": 117
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "GEHC expertise is in medical imaging and information technologies, medical diagnostics, patient monitoring systems, performance improvement, drug discovery, and biopharmaceutical manufacturing technologies to help clinicians around the world re-imagine new ways to predict, diagnose, inform and treat disease, so that the patients can live their lives to the fullest.",
    "length": 367
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "The ICC is a Shared Service function for performing Data Integration, System Integration, Enterprise Application Integration (EAI) and Business to Business (B2B) Integration using Middleware.",
    "length": 191
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Project Details 1.",
    "length": 18
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "webMethods Remediation Project Organization Tech Mahindra Role Technical Project Manager Duration Jan 2017 – Till Date Environment Oracle SOA 12C and webMethods Project Description WebMethdos Remediation project is retirement of webMethods platform and rebuilding interfaces in Oracle SOA 12C.",
    "length": 293
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "This project includes remediation of interfaces integrating with critical ERP’s ( SAP , Oracle, Peoplesoft) and around 60+ trading partners using all different B2B protocols to connect .",
    "length": 186
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "This was a large scale B2B migration also acknowledged by Oracle.",
    "length": 65
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Contribution Responsible for the overall management and delivery of the project.",
    "length": 80
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Prepare project plans, work with 3rd parties for project discussions and kick off.",
    "length": 82
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Analyze webMethods Interfaces and prepare designs in SOA 12C including B2B .",
    "length": 76
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Walk through designs with architects and take signoff.",
    "length": 54
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Provide technical guidance to team members at project level.",
    "length": 60
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Worked on B2B configurations for Trading partners .",
    "length": 51
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Manage project schedules, budget forecasts, resource plans.",
    "length": 59
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Involvement in the software development lifecycle from requirement gathering from customers, design ....",
    "length": 104
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Testing (DryRun, SIT, UAT , regression testing).",
    "length": 48
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Produce weekly status reports to update all stakeholders on project health and progress.",
    "length": 88
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "2. EHUB Retirement Organization Tech Mahindra Role Technical Project Manager Duration January 2016 – May 2017` Environment webMethods 8.x, (Integration Server, Broker, JDBC Adapter, Trading Network) Project Description The GE Healthcare Life Sciences (GEHC LS)",
    "length": 260
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "eTrading environment (a.k.a eHub) is a central point handling Life Sciences exchange of business documents to and from customers in Europe and North America.",
    "length": 157
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "This is also utilized in ePresence to process orders coming from the webshop.",
    "length": 77
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Main goal for the project is to replace existing legacy and aging eHub solution with reliable, scalable, and robustness one based on Middleware and BIOPROD.",
    "length": 156
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Contribution Responsible for the overall management and delivery of the project.",
    "length": 80
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Analyze Customer requirements and document high level requirements.",
    "length": 67
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Resolve client issues and queries concerning business functionality requirements Walk through requirement documents with customers and take signoff.",
    "length": 148
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Serve as the main driver of the client relationship and project communication.",
    "length": 78
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Manage project schedules, budget forecasts, resource plans.",
    "length": 59
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Involvement in the software development lifecycle from requirement gathering from customers, design ....",
    "length": 104
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Testing (DryRun, SIT, UAT , regression testing).",
    "length": 48
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Produce weekly status reports to update all stakeholders on project health and progress.",
    "length": 88
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Share best practices and consulting to clients throughout duration of the project.",
    "length": 82
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "3. Symphony - GE HealthCare ICC Engagement Organization Tech Mahindra Role Technical Project Manager Duration January 2014 – June 2016 Environment webMethods 8.x, (Integration Server, Broker, JDBC Adapter, Trading Network) Project Description Symphony is the project to synchronize and simplify processes in our Core Imaging and PET businesses.",
    "length": 344
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Migrating to one common platform (Global SAP) for Enterprise Resource Planning will bring transparency and operational efficiency to our business enabling us to respond to customers with greater speed and agility.",
    "length": 213
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Symphony project is executed in different phases in multiple regions – Nordics, CEU, SEU, USCAN, ASIA.",
    "length": 102
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Most of the middleware interfaces are with webMethods technology and wM components used are Trading network (exchange data with External partner ) ,webservices, FTP, FTPs.",
    "length": 171
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Contribution Assist the project team with identification of project deliverables, and creation of project-specific documentation such as functional specifications, technical specifications, etc. Act as a point of technical escalation and resolution during the project lifecycle.",
    "length": 278
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Provide technical guidance to clients and team members at program and project levels.",
    "length": 85
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Work closely with quality assurance resources to create test plans and ensure that issues are properly assigned, fixed, and regressed.",
    "length": 134
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Ensure that best practices for coding, architecture, and security are employed across all teams consistently, and maintain responsibility for the quality development of internal and external applications.",
    "length": 204
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Provide hands-on development and mentoring as necessary for other members of the development team.",
    "length": 98
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "4. GE Jenbacher BI Reporting Organization Tech Mahindra Role Developer Duration May 2013 – December 2014 Environment webMethods 7.x, (Integration Server, Broker ,JDBC Adapter) Project Description This interface is designed and implemented to minimize the negative effects on accounting of operating hours, on scheduling of maintenances and cause manual rework (risk of human errors).",
    "length": 383
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Build Service based integration between Romeo ERP and MyPlant application to exchange Counter data.",
    "length": 99
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Build Romeo-MyPlant Counter Synchronous service in webMethods, which receives required parameters from RomeoERP and using these parameters webMethods needs to build custom MyPlant URL and send request to MyPlant via xml over HTTP.",
    "length": 230
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "WebMethods will insert the response from MyPlant into Romeo ERP staging tables.",
    "length": 79
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Contribution Create the project plan, gathering the requirements.",
    "length": 65
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Develop the interfaces using flow service.",
    "length": 42
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Develop the java service to implement the logic of batch insert (improved performance from 3-4 hours to 3 mins )",
    "length": 112
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Create Unit test plan and Integration test plan documents with sample inputs provided from client",
    "length": 97
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Provide support during the test phase.",
    "length": 38
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Provide Post Production support after the completion of the project for 3 weeks 5.",
    "length": 82
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "BPM CoE, GE Organization Tech Mahindra Role Architect Duration April 2012 – May 2013 Environment webMethods 8.x, (Integration Server, Broker , BPMS, JDBC Adapter) a) Project Description Designed the below projects as part of BPM CoE team and worked on BAM and Blaze Advisor POCs. 1) PGS R5 Site Compensation Site Compensation is a Support Central workflow to place a request for Field Engineers Bonus compensation upon successful completion of an outage.",
    "length": 454
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Current process makes the Users to manually enter all the outage and Bonus details by looking at various systems.",
    "length": 113
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "All these information is available in PGS Portal Application.",
    "length": 61
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Also the support Central workflow is not robust for automation and reporting for changing Business needs.",
    "length": 105
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Business needs to develop this workflow within the PGS Portal Application to automate the workflow initiation steps and leverage the PGS Portal Building blocks data to auto populate workflow information where ever possible, thus reducing human intervention.",
    "length": 257
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "2) Catalog Automation The Catalog Automation project goal is to automate the existing process by removing the manual touch points, streamlining the process steps and moving the data from existing MS excels to a web based system.",
    "length": 228
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "The purpose of this project is to create a workflow that manages the Catalog Automation Process Application.",
    "length": 108
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Maintain a constant communication with the Catalog Application trough human or manual tasks, regarding the roles of ATA Owner, Risk admin, Super User, based on the process steps and situations.",
    "length": 193
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Communicate with a Catalog Data base, to update the ATA information.",
    "length": 68
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "b) Contribution Design the Projects.",
    "length": 36
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Understand the Functional Specs; provide feedback to Business Analyst Team if the Requirements can be implemented successfully.",
    "length": 127
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Project Name: BDMD EAI Operations Client GE Energy Role Administrator Organization Tech Mahindra Duration September 2011 – February 2012 Team Size Project :10 Module : 2 Environment Software Tools: WebMethods Integration Server Platform, webMethods Developer7.1.3, webMethods Trading Network Console, adapter Configuration, My webMethods Server, webMethods Monitor 7.1.3.",
    "length": 371
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "DB: Oracle O/s: Win NT Server 4.0 a) Project Description: The integration solution involving webMethods in GE power Systems involves over 4000 adapters and 125 brokers.",
    "length": 168
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "The BDMD EAI Operations which is currently one of the major projects in GE Power Systems integrates the existing legacy systems using Oracle, Mainframes, Sybase etc as databases with applications like PartsERP, PartsServieERP, ESERP, CPFinERP, Vastera, Oracle ErrorHandler and AERO using Java and other web applications.",
    "length": 320
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "The Middleware software is developed using WebMethods.",
    "length": 54
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Active works aids in using the existing databases with the newly developed applications, thus providing a reliable availability of the data.",
    "length": 140
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "This allows the users in various locations of GE across US and rest of the world to access required information from various applications using different databases. b) Contribution:",
    "length": 181
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Analysis and understand the business flow of technical services operation.",
    "length": 74
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Understand the complete process of log, track and resolve customer issues.",
    "length": 74
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Understanding of the process and fixing bugs Actively involved in conducting various forms of testing of the middleware with the applications across various locations of GE and perform any required bug fixing.",
    "length": 209
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Providing Production Support for Integrations.",
    "length": 46
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Monitoring the ATC log tables to find out the errors logged as part of Support.",
    "length": 79
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Migration of the integration components from one environment to other.",
    "length": 70
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Project Name: SSP5-SAPRepairs BPM integration Client GE Energy Role Developer Organization Tech Mahindra Duration July 2011 to September 2011 Team Size Project :2 Module : 1 Environment Software Languages : webMethods flow language, Java Database :Oracle 12i EAI:",
    "length": 263
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "webMethods 7x and 8x version (Integration server.",
    "length": 49
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Developer, Broker Servers, Monitor),BPM Adapters: SAP Adapter O/s : Solaris a) Project Description This project requires an interface to send Purchase Order and Receipt data to SAP Repairs system using SAP Adapter Service.",
    "length": 222
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "SSP5 is the source system responsible to send Purchase Order and Receipt to webMethods Integration layer via webMethods Trading Networks.",
    "length": 137
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "As part of this project, webMethods Business Process Models has been developed to consume Purchase Order & Receipt from SSP5 and send the data to SAP Repairs system via webMethods SAP adapter.",
    "length": 192
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "b) Contribution Designed the business process and the services/operations using webMethods to streamline the processes involved",
    "length": 127
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Taking care of all migration process in all the environments.",
    "length": 61
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Problem solving and bug fixing Monitoring process model status.",
    "length": 63
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Project Name: SFDC",
    "length": 18
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Oil&Gas interface Client GE Energy Role Developer Organization Tech Mahindra Duration November 2010 to June 2011 Team Size Project :1",
    "length": 133
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Module : 1 Environment Software Languages : WebMethods flow language, Java Database :Oracle 12i EAI: webMethods 7.1.2 version (Integration server.",
    "length": 146
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Developer, Broker Servers, Monitor) Adapters:JDBC Adapter Tools : Document Tracker, Tortoise CVS version 1.8.14,Database Pilot, WebMethods Monitor 7.1.2,webMethods Developer O/s : Solaris a) Project Description GE Energy’s current CRM platform has reached end of life.",
    "length": 268
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "It does not satisfy the needs of the various P&L’s within Energy and the ability to remain nimble and incorporate the various needs of the business is no longer achievable.",
    "length": 172
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "The business has decided to move to Salesforce.com and we need to integrate to and from systems that provide necessary data to be used with CRM.",
    "length": 144
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "This includes the development of SFDC Source integrationwhich replaces CMS and publishes data to 15 targets.",
    "length": 108
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "As a part of source integration, a webMethods provides the WSDL file to receive SFDC XML file .Received",
    "length": 103
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "XML is converted into webMethods internal document type and mapped to canonical, and published to broker.",
    "length": 105
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Published canonical is subscribed by 4 existing targets at present.",
    "length": 67
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "In future, we extend the SFDC integration to publish data to few more existing subscribers.",
    "length": 91
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "b) Contribution",
    "length": 15
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Create the project plan, gathering the requirements.",
    "length": 52
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Develop the interfaces using flow service, create utility services, webservice Descriptors .",
    "length": 92
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Create Unit test plan and Integration test plan documents with sample inputs provided from client",
    "length": 97
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Provide support during the test phase.",
    "length": 38
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Provide Post Production support after the completion of the project for 3 weeks 9.",
    "length": 82
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Project Name: EDI210 OUTBOUND for OTM Client GE Energy Role Developer Organization Tech Mahindra Duration June 2010 to December 2010 Team Size Project :2 Module : 1 Environment Software Languages : WebMethods flow language, Java Database :Oracle 11g EAI: webMethods 7.1.2 version (Integration server.",
    "length": 300
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Developer, Broker Servers, Monitor, Trading Networks) Adapters:JDBC Adapter Tools : Document Tracker, Tortoise CVS version 1.8.14,Database Pilot, WebMethods Monitor 7.1.2,webMethods Developer O/s : Solaris a) Project Description GE Energy Infrastructure has created an umbrella project, the vision for which includes each GEI P&L to have EDI210 outbound integration with OTM.",
    "length": 375
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "This includes the development of two integrations (source and target integrations).As a part of source integration, a webMethods provides the WSDL file to receive Glog XML file from OTM.Received Glog XML is converted into webMethods internal document type and mapped to canonical, and published to broker.",
    "length": 305
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "WebMethods target integration subscribes the published canonical from webMethods broker and generates EDI210 files as per standard EDI210 schema.",
    "length": 145
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "The generated EDI210 files are sent to Trax system through trading networks via AS2 protocol.",
    "length": 93
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Trax system will send the 997 ack back to webMethods with the status of EDI210 files.",
    "length": 85
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "WebMethods validate the received 997 files and send the 997’s with rejected status, to OTM.OTM cross checks the rejected EDI210 files and resends the valid data. b) Contribution Gather requirements, analyze the existing canonicals.",
    "length": 231
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Develop the interfaces using flow service, create utility services, webService Descriptors..",
    "length": 92
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Create Unit test plan and Integration test plan documents with sample inputs provided from client.",
    "length": 98
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Prepare all project related documents.",
    "length": 38
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Provide testing support in different environments.",
    "length": 50
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Project Name: GE Aviation PAC-Purchasing Application Consolidation Project Client GE Aviation Role Developer Organization Tech Mahindra Duration February 2010 to November 2010 Team Size Project :1 Module : 1 Environment Software Languages : WebMethods flow language, Java Database :Oracle 12i EAI:",
    "length": 297
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "webMethods 7.1.2 version (Integration server.",
    "length": 45
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Developer, Broker Servers, Monitor) Adapters:JDBC Adapter Tools : Document Tracker, Tortoise CVS version 1.8.14,Database Pilot, WebMethods Monitor 7.1.2,webMethods Developer O/s : Solaris a) Project Description GE Aviation Supply Chain business is consolidating its Legacy Purchasing applications in to a single Oracle eBusiness suite to manage and author the purchase orders.",
    "length": 376
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "This requires building webMethods integrations to exchange PO, Supplier, Item data between central Oracle eBusiness suite and 22 Legacy applications/ERPs.",
    "length": 154
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "For pilot implementation, Grand Rapids Legacy system is chosen.",
    "length": 63
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "The scope of the project is to build integrations from PAC Oracle 12i instance to Grand Rapids Legacy system and vice-versa.",
    "length": 124
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "There are total 21 Legacy systems need to be integrated with PAC instance. b) Contribution",
    "length": 90
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Create the project plan, gathering the requirements.",
    "length": 52
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Develop the interfaces using flow service, create utility services, webservice Descriptors and also implemented HTTP post.",
    "length": 122
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Create Unit test plan and Integration test plan documents with sample inputs provided from client",
    "length": 97
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Provide support during the test phase.",
    "length": 38
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Provide Post Production support after the completion of the project for 3 weeks 11.",
    "length": 83
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Project Name: GE Energy Fusion Project Client GE Energy Role Developer Organization Tech Mahindra Duration December 2009 to March 2010 Team Size Project :3",
    "length": 155
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Module : 1 Environment Software EAI: webMethods 6.1 & 6.5 platform (Integration server.",
    "length": 87
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Developer, Trading Networks 6.5, Broker Servers, Monitor) Adapters:JDBCAdapter Tools : Document Tracker, WmMonitor, WmBrokerAdmin, Trading Networks Console, Oracle 9i, Tortoise CVS version1.4.5 a) Project Description This Integration is built to transport data from JULIET ERP to GEXPRO.It is implemented ONLY for OU_PG_WIND and OU_PG_CAN operating units.",
    "length": 355
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "This connection will communicate purchase orders between the two systems.",
    "length": 73
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Built EDI outbound integration to send EDI850 (Purchase Order) data to the partner and EDI inbound integration to receive EDI997 (Acknowledgement) from the partner. b) Contribution",
    "length": 180
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Create the technical design of EDI850 and EDI997 basing on the requirements gathered (this interface was split into publish and subscribing integrations).",
    "length": 154
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Create partner profiles and processing rules in trading networks.",
    "length": 65
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Develop the interfaces using flow service, create utility services.",
    "length": 67
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Create Unit and Integration test plan documents using the sample inputs provided by the client.",
    "length": 95
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Provide support during the test phase.",
    "length": 38
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Provide Post Production support after the completion of the project for 3 weeks 12.",
    "length": 83
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Project Name: GE Energy JENBACHER-SPATSL Project Client GE Energy Role Developer Organization Tech Mahindra Duration December 2009 to February 2010 Team Size Project :1 Module : 1 Environment Software Languages : WebMethods flow language, Java Database :Oracle 9i EAI:",
    "length": 268
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "webMethods 6.1.1 version (Integration server.",
    "length": 45
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Developer, Broker Servers, Monitor) Adapters:JDBC Adapter Tools : Document Tracker, Tortoise CVS version 1.8.14,Database Pilot, WebMethods Monitor 6.1.1,webMethods Developer O/s : Solaris a) Project Description The primary objective of the Oracle SPATSL Interface integration is to publish Item, sBOM data from Oracle to SPATSL database.",
    "length": 337
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "On user button press in Romeo ERP to release the Design, the BOM data need to be synchronized with SPATL MS SQL Server database in real-time.",
    "length": 141
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "This process cannot run in Batch mode. b) Contribution",
    "length": 54
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Create the project plan, gather the requirements.",
    "length": 49
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Create technical design documents.",
    "length": 34
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Develop the interfaces using flow service, create utility services.",
    "length": 67
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Create Unit test plan and Integration test plan documents with sample inputs provided from client.",
    "length": 98
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Configure adapters for DB2, MSSQL.",
    "length": 34
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Project Name: GE Energy JENBACHER-SMARTEAM Phase II Project Client GE Energy Role Developer Organization Tech Mahindra Duration June 2009 to February 2010 Team Size Project :1 Module : 1 Environment Software Languages : WebMethods flow language, Java Database :Oracle 9i EAI:",
    "length": 275
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "webMethods 6.1.1 version (Integration server.",
    "length": 45
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Developer, Broker Servers, Monitor) Adapters:JDBC Adapter Tools : Document Tracker, Tortoise CVS version 1.8.14,Database Pilot, WebMethods Monitor 6.1.1,webMethods Developer O/s : Solaris a) Project Description The objective of this project is to synchronize Item details both in JENERP and SMARTEAM system.",
    "length": 307
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "After this integration, all the item information will also be maintained in SmarTeam system and there will be no manual intervention required for synchronizing it in the two systems.",
    "length": 182
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Implemented the design in 12 integrations (pub and sub model) including the ack integrations b) Contribution",
    "length": 108
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Update the technical design for 12 different integrations.",
    "length": 58
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Develop the interfaces using flow service, creating utility services Create Unit test plan and Integration test plan documents with sample inputs provided from client",
    "length": 166
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Provide support during the test phase.",
    "length": 38
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Provide Post Production support after the completion of the project for 3 weeks. 14.",
    "length": 84
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Project Name: eCustomer Project Client Cisco Systems Inc.",
    "length": 57
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "USA Role Developer Organization Tech Mahindra Duration October,2007 – May,2009 Team Size Project :8 Module : 1 Environment Software Languages : Tibco flow language, Java Database :Oracle 9i EAI: TIBCO Designer, and TIBCO Business Works Adapters:JDBC Adapter Tools : EMAN monitoring tool O/s : Linux OS a) Project Description Any new customer created in Cisco would be added in to the database.",
    "length": 393
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "Client system sends a request to Customer Registry (CR) Customer create/update/assign/delete/inactivate.",
    "length": 104
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "The client system decides the type of operation to be performed like Customer Create/Update/Delete/Inactivate and sends the request message to the respective messaging queue.",
    "length": 174
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "This interface does the creation of new party and updates any information of the existing party, inactive a party, delete the party physically from CR and Assign the party in SSOT before being created in source system image. b) Contribution Handle all P1 to P6 cases and providing RCA and LTF Personal Information: Name : Jayanandini Pobbathi Languages Known : English, Telugu, and Hindi Alternate Email : JNandini1324@gmail.com Passport No. : P2903133 US Work Permit : H1 B Contact Number :",
    "length": 491
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "+1 6463610131 Nandini Email : JNandini1324@gmail.com :",
    "length": 55
  },
  {
    "file": "Nandini_Resume.pdf",
    "sentence": "+1 6463611031 Professional Summary Management Experience (Onsite) Technical Experience : Education Achievements Employment Summary Program Details: Project Details 1. Technical Project Manager Project Description 2. Technical Project Manager Project Description 3. Technical Project Manager Project Description Contribution 4. Developer Project Description Contribution 5. Architect a) Project Description b) Contribution 6. Administrator a) Project Description: b) Contribution: 7. Developer a) Project Description b) Contribution 8. Developer a) Project Description b) Contribution 9. Developer a) Project Description GE Energy Infrastructure has created an umbrella project, the vision for which includes each GEI P&L to have EDI210 outbound integration with OTM. 10. Developer a) Project Description b) Contribution 11. Developer a) Project Description b) Contribution 12. Developer a) Project Description b) Contribution 13. Developer a) Project Description b) Contribution 14. Developer a) Project Description b) Contribution Personal Information:",
    "length": 1053
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Nikith Reddy Email: Nikith.k25@gmail.com Phone no: (510)-944-7683 SUMMARY:",
    "length": 74
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Having 9 years of IT experience in Object Oriented development, testing, and support of Enterprise applications using Java/J2EE technologies.",
    "length": 141
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Extensive experience in core Java and Advanced Java frameworks such as Spring (MVC, IoC, AOP, Security, DI, JDBC), Servlets, ORM tools (Java Persistence API, Hibernate and MyBatis), along with other java technologies like EJB, Junit, Apache Struts 2, Apache Axis, JFC (SWING, AWT, Java 2D), JSTL and log4j.",
    "length": 306
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Excellent Proficiency in frontend development using HTML, CSS, JavaScript, AngularJS, Backbone.js, jQuery, Bootstrap, AJAX and Adobe Flash.",
    "length": 139
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Expertise in developing and registering web services using JAX-RPC, JAX-WS, SAAJ, JAX-RS, SOAP, REST, WSDL, UDDI registry along with developing micro services and other middleware.",
    "length": 180
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Extensive experience with building cloud based applications.",
    "length": 60
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Has vast experience in relational databases like Oracle, MySQL, DB2, MongoDB, NoSQL, SQL and PL/SQL. Successfully designed and developed Java Multi-Threading based collector parser and distributor process, when the requirement was to collect, parse and distribute the data coming at a speed of thousand messages per seconds.",
    "length": 324
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Worked on MVC - Struts, JSF and spring framework.",
    "length": 49
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Explored Spark, Kafka along with other open source projects to create a real time analytics framework.",
    "length": 102
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Strong experience in developing and deploying applications through application servers like Apache Tomcat, IBM WebSphere, WebLogic and Jboss along with environments like Node.js.",
    "length": 178
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Proficient with J2EE design patterns such as Session Facade, Service Locator, DAO, DTO, Value Object, Front Controller, Factory, Business Object, and Singleton.",
    "length": 160
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Experienced with use case diagrams, activity diagrams, sequence diagrams and class diagrams using UML modeling tools like Rational Rose and Visio.",
    "length": 146
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Experience with JUnit, ANT, Jasmine and Maven scripts.",
    "length": 54
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Defined and created various functional requirement documents and design specification documents after performing requirement analysis for the systems to be developed and worked with bug tracking tools like JIRA Implemented Micro-services using Pivotal Cloud Foundry platform build upon Spring Boot Services Held responsibility for conceptual design, creation, and maintenance of system diagrams for development, testing & production environments, taking part in review of use case, design, code, test and implementation plans while working on all phases of Software Development Life Cycle.",
    "length": 589
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Excellent experience in building application with service-oriented-architecture (SOA).",
    "length": 86
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Skilled at interacting with clients, collection of requirement specifications from the client site, performing requirement analysis and designing.",
    "length": 146
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Has strong analytical & creative problem solving abilities along with written and verbal communication, interpersonal and presentation skills.",
    "length": 142
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Handled multiple tasks while managing time efficiently, meeting deadlines, coordinating project schedules and releases, meeting with clients and addressing their concerns.",
    "length": 171
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Has ability to quickly learn and apply new tools and technologies, translate algorithms and ideas into software applications.",
    "length": 125
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Designed back-end solutions for large-scale, on-demand marketing systems.",
    "length": 73
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Developed software using Jenkins integration service.",
    "length": 53
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Worked with Adobe Flexto create expressive and interactive interfaces.",
    "length": 70
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Extensive experience using XML and JSON as data interchange format for asynchronous requests along with good experience working with XML, XSLT, XSD and JAXB.",
    "length": 157
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Developed and deployed end-to-end enterprise applications using web technologies and enterprise technologies in client-server environment and distributed environments like 3-tier and N-tier architectures.",
    "length": 204
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Worked on testing tools like JUnit for application integration testing and built highly scalable and high performing web applications that support day-to-day operations.",
    "length": 169
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "EDUCATION: Bachelor’s degree from JNTUH April 2008.",
    "length": 51
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "TECHNICAL SKILLS: Software development and management tools Eclipse, IBM RAD, JBuilder, NetBeans, MyEclipse, Dream Weaver, Surround SCM, Rational ClearCase, CVS, SVN, GIT, SublimeText, Rational ClearQuest, Rational Rose XDE, TOAD, Oracle SQL Developer, Mantis Bug Tracker, PuTTY, WinSCP, Cygwin, Apache Ant, Apache Maven, MS Office, Drool, Enterprise Architect, Grunt, Bower, Jira, Webstorm, OEPE, STS, Spring Roo, Google Web Toolkit, Adobe Experience Manager Operating Systems Microsoft Windows, UNIX, LINUX, Solaris, Windows Server JAVA frameworks and technologies Junit, Log4j, Apache Struts 2, Spring, Hibernate, Apache Axis, Oracle WebLogic, Apache Tiles, Servlets, JSP, JDBC, JMS, EJB, SOAP, Java RMI, JavaMail, JAAS, JNDI, JNI, JAXP, JFC(SWING, AWT, Java 2D), JSF, JSTL, TLD, JPA, JAX-RPC, JAX-WS, JAX-RS, SAAJ, JTA, MyBatis UI Development technologies HTML, CSS, JavaScript, AngularJS, Backbone.js, jQuery, Bootstrap, AJAX, JSON, Adobe Flash Software development and test methodologies TDD, SDLC, UML, Design Patterns, Unit testing, SOA, OOAD, EAI, Agile, Scrum, Waterfall model Database management Oracle, MongoDB, IBM DB2, SQL, NoSQL, MySQL, MS SQL Server, ODBC, PL/SQL Web/Application Servers Apache Tomcat, OC4J, Oracle WebLogic Server, IBM WebSphere Application Server (WAS), JBoss (WildFly), Apache HTTP Server, IIS, GlassFish Other Languages and Technologies C, C++, Shell Scripting, Python, Perl, XML, XSD, DTD, XSL (XSLT, XSL-FO, XPath), SVG, ESB, Document Object Model, SAX, Wordpress, CORBA, SSO, REST, Uniface, Adobe Flex, Apache-CXF, Groovy, WSDL, IBM WebSphere software applications, Apache Zookeeper PROFESSIONAL EXPERIENCE: Client: GE-Transportation, Atlanta, GA Sep’15 to Till Date Role: Sr.Java/J2EE Developer Description: GE Transportation, formerly known as GE Rail, is a division of General Electric.",
    "length": 1829
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "The organization manufactures equipment for the railroad, marine, mining, drilling and energy generation industries.",
    "length": 116
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "It is headquartered in Chicago, Illinois while their main manufacturing facility is located in Erie, Pennsylvania.",
    "length": 114
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Locomotives are assembled at the Erie plant, while engine manufacturing takes place in Grove City, Pennsylvania. Responsibilities: Involved in Full stack development based on J2EE specifications and Spring Framework with MVC architecture.",
    "length": 238
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Developed using web based technologies such as Hibernate ORM and Web Services (REST/SOA /micro services).",
    "length": 105
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Involved in developing the Angular js MVC framework for the Single Page Application development.",
    "length": 96
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Implemented different design patterns such as singleton, Session Façade, Factory, MVC, Business delegate, session facade and DAO design patterns.",
    "length": 145
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Web application development for backend system using Node.js with cutting edge HTML5 and CSS3 techniques Used JPA (Object Mapping for the backend data persistency).",
    "length": 164
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Worked with tracking tool JIRA on Agile Scrum performance estimation and capacity planning work with the project manager and product development teams to create and implement projects.",
    "length": 184
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Implemented purchase order entry and reporting modules using Swing (JFC) to handle client side GUI.",
    "length": 99
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Development of front end web pages using JSP2.0, JSON, Angular JS, JS Bootstrap, CSS, JavaScript and Spring TLD.",
    "length": 112
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Expertise in working with the JavaScript, prototype JS and various MVC JavaScript frameworks Node.js.",
    "length": 101
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Responsible for designing and coding of User Interfaces using JSF, Pretty faces.",
    "length": 80
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Design and Development of High Performance CPD processes by using multithreaded processes which in turn improved the performance by a lot.",
    "length": 138
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Worked on cloud based applications implementing a service-oriented-architecture (SOA).",
    "length": 86
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Tested code using TDD approach to development which combines test-first development where you write a test before you write just enough production code to fulfill that test and refactoring.",
    "length": 189
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Used Bootstrap and Angular 2.0 for effective design of Web pages. Developed using Maven build scripts to automate the deployment to various Web Server.",
    "length": 151
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Configured Oracle WebLogic Server forms part of Oracle Fusion Middleware portfolio which supports Oracle, and other JDBC-compliant databases.",
    "length": 141
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Created User services in Cloud Foundry for connecting database with different life cycles using spring profile.",
    "length": 111
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "The user interface components are developed using Java AWT/swing API.",
    "length": 69
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Oracle WebLogic Server Process Edition configuration also includes Business Process Management and Data Mapping functionality.",
    "length": 126
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Wrote Karma Jasmine unit, Specflow C integration, and Protractor Jasmine integration tests with every feature.",
    "length": 110
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Worked high end on collections and multithreading.",
    "length": 50
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Worked with NoSQL database MongoDB and developed custom MongoDB applications specific to clients' needs.",
    "length": 104
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Worked exclusively on Tomcat for managing performance and security optimization for Web Applications.",
    "length": 101
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Used GIT for source control and developed a logging component using Log4J to log messages and errors. Involved in resolving bugs post production and resolved performance issues and participated in code reviews.",
    "length": 210
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Worked on relational databases and wrote SQL scripts to manage the database.",
    "length": 76
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Developed RESTful API for searching over the patents using SolrJ and SolrCloudServer.",
    "length": 85
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Zookeeperis used as the monitoring tool.",
    "length": 40
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Used JSP and HTML/CCS to implement the Web Service in Tomcat.",
    "length": 61
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Focused on Test Driven Development; thereby creating detailed JUnit tests for every single piece of functionality before writing the functionality.",
    "length": 147
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Created yaml file to push the application in Pivotal Cloud Foundry(PCF) Built a new CI pipeline.",
    "length": 96
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Testing and deployment automation with Docker, Jenkins, and Ansible.",
    "length": 68
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Experienced with Flex framework for building and maintaining web applications.",
    "length": 78
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Monitored the error logs using Log4J and fixing the problems.",
    "length": 61
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Environment: Java, JSP, JMS, AJAX, Log4j,Node JS, jQuery, RESTful web services, Swing (JFC) , JSON, XML, JAX-WS, Apache CXF, AngularJS, Spring, Hibernate, JavaScript, Jasmine HTML, Apache Tomcat, Pivotal Cloud Foundry ,Ansible, CSS, Apache Zookeeper , Spark, Kafka, EJB, ANT, JUnit, Jboss, ECLIPSE LUNA, GIT, and Oracle, MongoDB. Client:",
    "length": 337
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Charter Communication, Tampa, FL Apr’14 – Aug’15 Role: Java Full Stack Developer Description: Charter Communications navigated its way to the #2 cable company by making a bigger boat.",
    "length": 183
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "The cable system operator leaped to the second spot, behind Comcast, with its acquisitions of Time Warner Cable and Bright House Networks for a total of some $70 billion in 2016.",
    "length": 178
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "The deal expanded the reach of the company, which has taken the name Charter Spectrum.",
    "length": 86
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Serving 17 million video subscribers and 19 million broadband customers, it offers a full range of services to residential and business subscribers including cable TV, high-speed Internet, Voice over IP telephone, and entertainment packages.",
    "length": 241
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Its Charter Business unit provides Internet access, data networking, phone, and wireless backhaul services to about 500,000 commercial clients.",
    "length": 143
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Responsibilities: Worked on gathering system requirements for the application, working with the business team to review the requirements in the software requirement specification document, architecture document followed by other phases of Software Development Life Cycle.",
    "length": 271
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Designed and developed systems based on J2EE specifications and used Spring Framework with MVC architecture.",
    "length": 108
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Used Spring Roo Framework Design/Enterprise Integration patterns and REST architecture compliance for design and development of applications.",
    "length": 141
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Involved in the application development using Spring Core, Spring Roo, Spring JEE, Spring Aspects modules and Java web based technologies such as Web Service (REST/SOA /micro services) including micro services implementations and Hibernate ORM.",
    "length": 244
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Analyzed the Node.",
    "length": 18
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "JS server structure in legacy project, then mimicked the REST service by using Java JAX- WS API, and did the corresponding configurations.",
    "length": 138
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Used multithreading for writing the collector parser and distributor process, which was getting real time data from API in format of JSON, using multithreading improved the performance by a lot.",
    "length": 194
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "More over using concurrency package of collections made it thread safe.",
    "length": 71
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Testing/BDD using Jasmine for JS unit tests and Cucumber for integration tests Involved in developing custom components using JSF, JQuery. Implemented different design patterns such as singleton, Session Façade, Factory, and MVC design patterns such as Business delegate, session façade and DAO design patterns.",
    "length": 311
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Used JPA - Object Mapping for the backend data persistency.",
    "length": 59
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Worked on Agile Scrum performance estimation and capacity planning work with the project manager and product development teams to create and implement projects.",
    "length": 160
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Involved in project migration (existing swing application to web integration) using Struts 2.0 web frame work based on MVC2 Architecture.",
    "length": 137
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Developed on demand, combo and compression server using Node.js.",
    "length": 64
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Created Single Page Application with loading multiple views using route services and adding more user experience to make it more dynamic by using AngularJS framework.",
    "length": 166
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Worked and configured Mongo DB using spring -JPA and Spring Data to store hierarchical data.",
    "length": 92
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Tested the code using TDD approach to development which combines test-first development where you write a test before you write just enough production code to fulfill that test and refactoring.",
    "length": 193
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Developed front end web pages using JSP2.0, JSON, jQuery, Angular JS, CSS, JavaScript and SPRING TLD.",
    "length": 101
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Developed Maven build scripts to automate the deployment to various Web Servers.",
    "length": 80
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Slimming and fine tuning the Enterprise JBoss Application server image Architected and designed Rapid deployment method using Ansible to auto deploy servers as needed.",
    "length": 167
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Used JDBC to connect & retrieve data from DB (for existing Swing application) to connect to Oracle.",
    "length": 99
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Implemented a high-performance data processing platform using Apache Kafka, Apache Cassandra, and Apache Spark to analyze stock data.",
    "length": 133
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Executed the test steps defined in Test Cases and reporting the bugs in JIRA.",
    "length": 77
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Responsible for maintaining and expanding AWS (Cloud Services)",
    "length": 62
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "infrastructure using AWS",
    "length": 24
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Stack especially worked with database setup and maintenance on AWS EC2.",
    "length": 71
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Configured Tomcat server which gave users a single point of access to the applications, services, information and social connections they need.",
    "length": 143
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Wrote SQL scripts to manage databases.",
    "length": 38
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Environment: Java, JSP, Soap Web Services, PL SQL, SDLC, JavaScript, Node.js, Jasmine, Apache Tomcat, Swing, Ansible, Apache Kafka, HTML, Jboss, MongoDB, CSS, Oracle 11g, CVS, Windows XP, Eclipse, SVG, RAD (Rational Application Developer), AWS, Toad, , SQL Developer, putty, WinSCP, Rallydev.",
    "length": 292
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Client:",
    "length": 7
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Nationwide Insurance - Columbus, OH Aug’13- Mar’14 Role: Full Stack Java Developer Description: Nationwide Mutual Insurance Company is well known for providing insurance and financial services in the United States.",
    "length": 214
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "One of the Web Application CIQ involves the design and development of a Web based internet application to provide online insurance services.",
    "length": 140
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "The web application provides functionalities such as Internet Insurance Quote for Customers and Agents.",
    "length": 103
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "The customer can access complete account information, policy information, and receive instant auto insurance quote and report a claim.",
    "length": 134
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Developed from scratch therefore involved in Design and Development of the web application until deployment and production support.",
    "length": 131
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Responsibilities:",
    "length": 17
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Developed new architectural design solutions, functional and technical requirement specifications, use cases, non- functional requirements and provide expertise to technical and functional efforts, teams, and projects with full stack development.",
    "length": 246
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Designed new UML diagrams through Use Case Diagrams, Class Diagrams, Sequence, components, activity.",
    "length": 100
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Identified scenarios and strategies for performance testing and collaborate with test team on execution.",
    "length": 104
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Created SOA systems architecture and high‐level design for scalable and high‐performance enterprise applications.",
    "length": 113
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Established relationships and lead/direct technical development teams for SOA‐based design, architecture, development, and testing.",
    "length": 131
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Created Architecture enhancements for Distributed J2EE applications and legacy integration with Mainframes applications.",
    "length": 120
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Involved in the application development using Spring Core, MVC modules and Java web based technologies; such as, Servlets, JSP, Java Web Service (REST/SOAP based), WSDL.",
    "length": 169
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Worked on Backbone views with declarative event handling which connects it all to the existing API over a RESTful JSON interface.",
    "length": 129
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Deployed flow of Execution in the Servlets Environment using JSF and defined Navigation Rules for handling page Navigations using Spring WebFlow.",
    "length": 145
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Implemented JSF Converters to handle formatting and Localization and configured the faces-config.xml to create a web application navigation rule.",
    "length": 145
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Used Callable objects for implementing multithreading for parallel execution of independent events.",
    "length": 99
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Implemented different design patterns such as singleton, business factory and J2EE design patterns such as Business delegate, session façade and DAO design patterns.",
    "length": 165
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Developed the HTTP based Web Service Client which calls up the existing web service to get the application related data which comes in XML format.",
    "length": 146
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Used AngularJS directives to reduce the usage of redundant code and to create pie-charts, bar-graphs and also familiar in using data-binding and dependency-injection concepts in AngularJS.",
    "length": 188
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Used Hibernate - Object Relational Mapping Tool for the backend data persistency.",
    "length": 81
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Created a spring container file for configuring Hibernate and to perform Dependency injection among all bean class involved in business logic operation.",
    "length": 152
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Fetching the records for SOAP and Restful requests from Oracle DB using SOLR search.",
    "length": 84
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Worked with Tomcat as the application server and WebLogic as the webserver.",
    "length": 75
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Used No SQL databases like AWS DYNAMO DB and S3 for data persistence.",
    "length": 69
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Wrote services to store and retrieve user data from the MongoDB for the application on devices.",
    "length": 95
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Performed estimation and capacity planning work with the project manager and product development teams to create and implement projects.",
    "length": 136
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Used Struts and JSTL tag libraries in the JSP pages.",
    "length": 52
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Executed all the web service test scenarios by using SOAP UI.",
    "length": 61
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Automated test cases with SOAP UI and Groovy scripting.",
    "length": 55
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Developed front end web pages using JSP2.0, JSON, Angular JS, CSS, JavaScript.",
    "length": 78
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Developed Maven build scripts to automate the deployment to various Web Servers.",
    "length": 80
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Environment: UML, OOAD, Agile/SCRUM, GOF Patterns, SOA Patterns, EAI Patterns, MongoDB, RSA, MS Visio, Java 7, JSP, Droplets, jQuery, MySQL, Angular JS, JSON, Dynamo Servlets, JDBC, Struts1.1, ATG 9.0, XML, Apache Tomcat, EJB, JMS, Oracle 10g, Linux, Maven, XML, AWS, Web Services (SOAP, Rest full), Soap UI, Solr, Splunk, Jenkins Client:",
    "length": 338
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Agfa Healthcare -Mountain View, CA Nov’12- Jul’13 Role: Java/J2EE Developer Description: Agfa HealthCare supplies hospitals and other care organizations with imaging products and systems, as well as information systems.",
    "length": 219
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "It comprises of many projects like Enterprise Imaging, Integration Care, Digital Radiology and Education.",
    "length": 105
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "In Agfa, I work for cardiology department as a R&D java developer, where it is a section of Enterprise Imaging project and it captures the images of heart, create the cardiac data of patient and will be send to care teams.",
    "length": 222
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "As part of project, I implemented the GUI and report view by using the AngularJS framework and Core java concepts (with EJB as interface).",
    "length": 138
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Responsibilities: Developed SVN controls to track and maintain the different version of the project.",
    "length": 100
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Actively involved in analysis, detail design, development, bug fixing and enhancement in agile methodology.",
    "length": 107
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Involved in daily scrum and sprint planning meetings.",
    "length": 53
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "By using AngularJS implemented rich functionality by creating advance directives, services, events, CRUD, grid options, and multi - selection.",
    "length": 142
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Also added new features and worked performance optimization.",
    "length": 60
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Enhanced the features of diagram based graphics by using SVG and AngularJS frame work.",
    "length": 86
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Created templates using HTML & CSS and developed components using AngularJS.",
    "length": 76
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Performed Unit Testing using Jasmine.",
    "length": 37
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Worked on Collections extensively to store, retrieve and manipulate Objects in business logic layer to generate the data into Jasper Reports.",
    "length": 141
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Used various core java concepts like Collections and Multithreading for complex data computations and analysis.",
    "length": 111
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Expertise in Selenium Automation using Selenium WebDriver, Selenium IDE, Java & Maven.",
    "length": 86
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Used iReport tool for Jasper Report configuration.",
    "length": 50
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Created documents for Software design and work flow with sequence diagrams, data flow diagrams and entity relationship diagrams.",
    "length": 128
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "XSLT was used to get reusability with XSL-FO.",
    "length": 45
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Handled QC defects, worked with test team and validate the defects.",
    "length": 67
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Developed Exception handling framework and used log4J for logging.",
    "length": 66
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Worked on HP Quality Center tool for executing the test cases to test the application.",
    "length": 86
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Involved in writing test cases for Selenium Automation Tool to test the application.",
    "length": 84
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Performed importing of data into application by using Hapi Test Panel.",
    "length": 70
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Used JBoss as a server to run the application and deploy WAR files.",
    "length": 67
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Extensively use Eclipse, Notepad++ and Sublime IDE's with SVN Tortoise as Code Repositories.",
    "length": 92
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Environment: Java, J2EE, EJB, Json, RESTful Services, AngularJS, HTML, XSLT, JavaScript, CSS, Selenium IDE, iReport Tool, HP Quality Center, Eclipse, MySQL and Jboss Server.",
    "length": 173
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Client:",
    "length": 7
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "ING Vysya Bank, New Delhi India Aug’10 – Oct’12 Role: Java/J2EE Developer Description: ING Vysya Bank was a privately owned Indian multinational bank based in Bangalore, with retail, wholesale, and private banking platforms formed from the 2002 purchase of an equity stake in Vysya Bank by the Dutch ING Group.",
    "length": 310
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "This merger marked the first between an Indian bank and a foreign bank.[3]",
    "length": 74
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Prior to this transaction, Vysya Bank had a seven-year-old strategic alliance with erstwhile Belgian bank Banque Bruxelles Lambert, which was also acquired by ING Group in 1998.",
    "length": 177
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Responsibilities: Involved in analysis, design and development of e-bill payment system as well as account transfer system and developed specs that include Use Cases, Class Diagrams, Sequence Diagrams and Activity Diagrams Prepared solution Involved in designing the user interfaces using JSPs.",
    "length": 294
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Developed custom tags, JSTL to support custom User Interfaces.",
    "length": 62
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Developed the application using Spring Framework that leverages classical Model View Layer (MVC) architecture.",
    "length": 110
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Hands on experience on MS Sql solving complex query.",
    "length": 52
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Used Eclipse for writing code for JSP, Servlets.",
    "length": 48
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Implemented persistence layer using Hibernate that use the POJOs to represent the persistence database tables.",
    "length": 110
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "These POJOs are serialized Java Classes that would not have the business processes Implemented Hibernate using the Spring Framework (Created the session Factory).",
    "length": 162
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Implemented various J2EE Design patterns like Singleton, Service Locator, Business Delegate and Transfer Object.",
    "length": 112
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Tested HL7 messages through the deployed route/project with proper configuration properties files using Putty and winscp.",
    "length": 121
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Implemented the application using the concrete principles laid down by several design patterns such as MVC, Business Delegate, Data Access Object, Singleton and Factory.",
    "length": 169
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Deployed the applications on BEA WebLogic Application Server.",
    "length": 61
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Developed JUnit test cases for all the developed modules.",
    "length": 57
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Used CVS for version control across common source code used by developers.",
    "length": 74
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Used Log4J to capture the log that includes runtime exceptions.",
    "length": 63
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Used JDBC to invoke Stored Procedures and database connectivity to ORACLE.",
    "length": 74
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Refactored the code to migrate from Hibernate2.x version to Hibernate3.",
    "length": 71
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "(I.e. moved from xml mapping to annotations) and Implemented the Hibernate Filters and Hibernate validators.",
    "length": 108
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "DAO and the hibernate transactions was implemented using spring framework.",
    "length": 74
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Generated property list for every application dynamically using Python.",
    "length": 71
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Used AJAX and JavaScript for validations and integrating business server side components on the client side with in the browser.",
    "length": 128
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Environment: Java, J2EE, JSP, JNDI, Python, Oracle 10g,HL7, DHTML, ANT, Rationale Rose, Eclipse 3.1, Unix, Web logic Application Server, Hibernate 3.0, Spring, LOG4J, CVS.",
    "length": 171
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Client:",
    "length": 7
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Spencer’s, Bangalore, India Jun’08– Jul’10 Role: Java Developer Description: David Spencer Ltd. (commonly known as Spencer's) operated a department store chain in the province of British Columbia, Canada during the late 19th century and the first half of the 20th century.",
    "length": 272
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Founded in the city of Victoria in 1873 by David W. Spencer, the first store, located on Government Street, consisted of a dry goods shop operating under the name \"Spencer and Denny\".",
    "length": 183
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "The store prospered and expanded, and a second store was opened in 1890 in Nanaimo.",
    "length": 83
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "The Vancouver store, which opened in 1907, was so successful that it soon expanded to occupy almost an entire city block.",
    "length": 121
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Other stores later opened in Chilliwack and New Westminster. Responsibilities:",
    "length": 78
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "This project was to develop the e-commerce platform of Spencer’s in India.",
    "length": 74
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Built the home page, implemented the add product functionality along with the variations in the product features.",
    "length": 113
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Implemented the checkout functionality and the payment gateway.",
    "length": 63
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Created Single Page Application with loading multiple views using route services and adding more user experience to make it more dynamic by using AngularJS framework.",
    "length": 166
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Involved in designing the user interfaces using JSPs.",
    "length": 53
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Developed custom tags, JSTL to support custom User Interfaces.",
    "length": 62
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Analysis of business & system requirements including impact analysis on existing systems.",
    "length": 89
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Involved in developing database transactions using JDBC.",
    "length": 56
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Involved in using Spring Framework IOC for bean conceptual application and Spring ORM framework for mapping database using Hibernate.",
    "length": 133
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Written hibernate-cfg.xml file in Hibernate for mapping objects to the relational database.",
    "length": 91
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Used web services to retrieve the custom documents.",
    "length": 51
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Developed messaging system using JMS and written message listeners.",
    "length": 67
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Developed DAO (Data Access Object) classes in order to access data from database.",
    "length": 81
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Used SVN as Version Control Software.",
    "length": 37
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Tested the critical application’s functionalities before moving those into production by using various testing methodologies.",
    "length": 125
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Co-ordinated with QA for testing, Production releases, Application deployment, integration and conducting walk-through code reviews Environment: Spring, HTML5, CSS, Junit, PayPal API, JDBC, Servlets, JSP, Eclipse.",
    "length": 213
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "EDUCATION: TECHNICAL SKILLS:",
    "length": 28
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "PROFESSIONAL EXPERIENCE: Client: GE-Transportation, Atlanta, GA Sep’15 to Till Date Role: Sr.Java/J2EE Developer Client:",
    "length": 120
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Charter Communication, Tampa, FL Apr’14 – Aug’15 Role: Java Full Stack Developer Client:",
    "length": 88
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Nationwide Insurance - Columbus, OH Aug’13- Mar’14 Role: Full Stack Java Developer Client:",
    "length": 90
  },
  {
    "file": "Nikith Reddy.pdf",
    "sentence": "Agfa Healthcare -Mountain View, CA Nov’12- Jul’13 Role: Java/J2EE Developer Client: ING Vysya Bank, New Delhi India Aug’10 – Oct’12 Role: Java/J2EE Developer Client: Spencer’s, Bangalore, India Jun’08– Jul’10 Role: Java Developer",
    "length": 229
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Email Id: Prasanna@intellyk.com Contact # 732-399-9510 ext. 108 RAVI PATTAR Senior Agile Program Manager/ Certified Scrum Master/ Certified PMP Manager SUMMARY: 17 years of IT experience currently working as Group Project Manager, Engineering/R&D with HARMAN Connected Services (a Samsung Company)",
    "length": 297
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Agile/Scrum/PMP Certified PMP, Scrum and Trained Lead SaFE Agilist (4.0) with proven competence in building, training Agile Scrum teams and facilitating Scrum Masters Extensive experience in Sprint planning and estimation, tools like Poker Estimation, KANBAN Hands on experience in Change management and accommodate new business requirements by prioritizing and performing impact analysis Involved in driving the team to achieve high velocity and burn down rates Conducted RTE  activities across product lines",
    "length": 510
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Currently undergoing Nanodegree certification on Data Science using Python Technical Skills: Software Development/Management Platforms Microsoft, Java, Cloud enablement (Azure, AWS), Micro services, Native and Cross Platform application (Mobile, Web), Implementation, Support & Maintenance, Digital Transformation and Product Modernization; for global ISVs and Enterprises o Open Source: Core Java, Servlets, Spring, Hibernate, and PHP Microsoft MVC 5.0, 4.0, ASP.NET 2.0, ASP.NET 3.5, 4.5, .NET",
    "length": 495
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "C#, Web Service, SQL SERVER 2013.",
    "length": 33
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Frontend JQUERY, Angular JS, Bootstrap, HTML 5, CSS, Java Script DB SQL Server 2008, Oracle 10/11 Release & Deployment tools GIT, JENKINS, ANT Project Management tools JIRA, Trello, MPP, Visio, Confluence, and SharePoint Manual test & Automation tools TFS, Selenium Framework, Rational Robo Domain Expertise in business domains including Retail, Finance, Legal, ALM and B2C, catering to building grounds up applications to their maintenance.",
    "length": 441
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Acted as proxy product owner in the geo absence of Product Management team.",
    "length": 75
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Project Management/People Management Skilful in Conflict Resolution, Risk Identification and Mitigation and Performance Management & People Management",
    "length": 150
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Highly capable in multi-tasking and managing multiple projects for processing requirements from conceptualization to final delivery.",
    "length": 132
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Solid understanding of SDLC from Requirements Analysis to Post Implementation Extensive expertise in project planning, schedules, resources, cost & overall project management plan.",
    "length": 180
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "High degree of collaborations & effective communication among stakeholders.",
    "length": 75
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Good knowledge handling releases and deployment via CI / CD. mailto:Prasanna@intellyk.com",
    "length": 89
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Email Id: Prasanna@intellyk.com Contact # 732-399-9510 ext. 108 RAVI PATTAR Senior Agile Program Manager/ Certified Scrum Master/ Certified PMP Manager Conduct Scrum ceremonies; daily stand up, backlog grooming, Iteration planning, Iteration close & Retrospection.",
    "length": 264
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Facilitated code reviews, created best practices knowledge base, and created Lessons learnt knowledge base at the end of each sprint & project Manage project budget, time lines, quality and P&L parameters EDUCATION:",
    "length": 215
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Bachelor of Engineering (Electronics & Communication) 1998, .Karnataka",
    "length": 70
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "University India PROFESSIONAL TRAINING AND CERTIFICATIONS:",
    "length": 58
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Lead SAFe Agilist ~",
    "length": 19
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "PMP ~ Scrum professional ~Java Sun certification (2000) ~",
    "length": 57
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "TQMI Internal Auditor IS0 9001:2000 ~",
    "length": 37
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Soft skills development PROFESSIONAL EXPERIENCE: Client: NCR Corporation, Atlanta USA May, 2017 to till Date Role: Group Project Manager/Agile Program Manager Project Description:",
    "length": 179
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "It’s a leading transaction based Hardware and software company Responsibilities:",
    "length": 80
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "As a Group project manager, I was responsible for delivery of the above requirements which was 25 people engagement and was spread across 4 different locations (Bangalore, OMAHA(USA), Atlanta(USA), Plano(USA))",
    "length": 209
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Responsible for acting as Scrum of Scrum conducting daily meetings to review the progress made by scrum teams and helping to resolve their impediments.",
    "length": 151
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Involve in techno/Functional discussions and coordinate with customer to provide right solutions and clarifications;",
    "length": 116
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Coordinate and manage CICD deployment & releases and dependency within different teams.",
    "length": 87
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Estimate work efforts for project sizing, and efficient work flow with risk free technical approaches.",
    "length": 102
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Guided & Coached teams with Agile / Scrum Processes, managed & groomed backlog.",
    "length": 79
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Administering the Jira board and presenting it to customer on alternate day basis.",
    "length": 82
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Managing project health through Process excellence team for providing better quality deliverables conducting code reviews, documents reviews and demos, Managing project budget, time lines, quality and P& L Parameters.",
    "length": 217
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Environment: MDM, Core Java Servlets, DB Agonistic, SQL Server, DB2, HTML, JavaScript, Tomcat/Apache, WMS, .NET",
    "length": 111
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Framework 4.6, ASP.NET web forms.",
    "length": 33
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "MSMQ, SQL Server 2008 R2, Pricing, Java Servlets, SQL Server Client:",
    "length": 68
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "CitiXsys Inc, NY November, 2015 to May, 2017 Role: Group Project Manager/Lead Agile Program Manager Project Description: Modernizing CitiXsys core suite is highly essential due to change in technologies and use cases in retail.",
    "length": 227
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Modernization program objective is to have complete suite re-engineering on technology agnostic, seamless and ease of deployment, maintenance, secure and highly scalable.",
    "length": 170
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Responsibilities:",
    "length": 17
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "As a Group project manager, I was responsible for delivery of the above requirements which was 55 people engagement and was spread across 4 different locations (Bangalore, Coimbatore, Russia and Delhi) mailto:Prasanna@intellyk.com Email",
    "length": 236
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Id: Prasanna@intellyk.com Contact # 732-399-9510 ext. 108 RAVI PATTAR Senior Agile Program Manager/ Certified Scrum Master/ Certified PMP Manager",
    "length": 145
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Conducting meetings with customer on Technical Requirements initially, document and sign off.",
    "length": 93
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Responsible for acting as Scrum of Scrum conducting daily meetings to review the progress made by 4 scrum teams and helping to resolve their impediments.",
    "length": 153
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Involved in driving the team to achieve higher velocity & huge burn down rates in small two week Iterations.",
    "length": 108
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Coordinate and manage CICD deployment & releases and dependency within different teams.",
    "length": 87
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Estimate work efforts for project sizing, and efficient work flow with risk free technical approaches.",
    "length": 102
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Guided & Coached teams with Agile / Scrum Processes, managed & groomed backlog.",
    "length": 79
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Administrating the JIRA board and presenting it to the customer on alternate basis.",
    "length": 83
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Conducting monthly and quarterly business reviews with customer with agile project metrics and dashboards.",
    "length": 106
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Visiting customer counterparts at their location and helping team to provide effective demo and feedback and sign off.",
    "length": 118
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Managing project health through Process excellence team for providing better quality deliverables conducting code reviews, documents reviews and demos.",
    "length": 151
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Managing project budget, time lines, quality and P& L Parameters Environment: MVC 5.0, 4.0, ASP.NET 2.0, ASP.NET 3.5, 4.5, .NET",
    "length": 127
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "C#, Web Service, Sql Server 2013 Client: Consensus Inc (Subsidiary of Target Corporation), San Francisco July, 2015-November, 2015 Role: Group Project Manager/Senior Delivery Manager Project Description: The Consensus Engineering project is to maintain the existing POA application with feature enhancements.",
    "length": 308
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "This caters to the in-house need of Target Corporation.",
    "length": 55
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Design and develop next generation POA and OOPIS systems.",
    "length": 57
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "These caters to the Target sales team (in-store) and opens up a new sales channel on B2C. These applications/products will help Target to on-board customers, maintain their profiles, carrier selection, tariff plans, credit scores, insurance and other workflows of the telecom retail. Responsibilities:",
    "length": 301
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "As a Group project manager, I was responsible for delivery of the above requirements which was 120 people engagement and was spread across 2 different locations (San Francisco & Bangalore)",
    "length": 188
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Responsible for acting as Scrum of Scrum conducting daily meetings to review the progress made by 8 scrum teams and helping to resolve their impediments.",
    "length": 153
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Involved in driving the team to achieve higher velocity & huge burn down rates in small two week Iterations.",
    "length": 108
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Coordinate and manage CICD deployment & releases and dependency within different teams.",
    "length": 87
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Estimate work efforts for project sizing, and efficient work flow with risk free technical approaches.",
    "length": 102
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Guided & Coached teams with Agile / Scrum Processes, managed & groomed backlog.",
    "length": 79
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Administering the Jira board and presenting it to customer on alternate day basis.",
    "length": 82
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Managing project health through Process excellence team for providing better quality deliverables conducting code reviews, documents reviews and demos Environment: Development: Linux, PHP 5.x, MySQL 5.x, HTML5, CSS3, Angular JS, jQuery, AWS cloud Services Third-party Integration Libraries: Verizon, AT&T, Sprint APIs, Cyber Source auth, Aurus Pay, AppleCare Insurance, Square Trade Insurance Build/Release and others: GitHub, JIRA, Confluence, Jenkins mailto:Prasanna@intellyk.com Email Id: Prasanna@intellyk.com Contact # 732-399-9510 ext.",
    "length": 541
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "108 RAVI PATTAR Senior Agile Program Manager/ Certified Scrum Master/ Certified PMP Manager Client:",
    "length": 99
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Acesse Corporation, Redwood City, CA April, 2014 to June, 2015 Role: Senior Project Manager/Agile Program Manager/Scrum Master Project Description: Acesse has suite of online software products which are mainly used in China for content management, online marketing, Conference meetings and Mobile Chat related products Responsibilities: Set up the entire Jira processes, boards, trainings.",
    "length": 389
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Trained the entire organization on Agile and Scrum.",
    "length": 51
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Agile Program management for 4 of their scrum teams which were spread across Romania, Minneapolis USA, Redwood City USA and Hyderabad.",
    "length": 134
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Conducted monthly management meetings and helped then with metrics and analysis of all scrum teams with respect to schedule, delivery and quality/ Conducted all sprint ceremonies like Sprint Planning, daily stand up, reviews & retrospective meetings for all scrum teams",
    "length": 269
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Worked as co-product owner for some of their products and helped to build requirements and Traceability.",
    "length": 104
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Bridged the gap between PO & QA teams.",
    "length": 38
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Being a single point of contact for their 50 member offshore team, conducted daily review meetings, monthly project progress reviews and coordinated production releases.",
    "length": 169
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Environment: PHP, My SQL, MS SQL, Android and IOS Client:",
    "length": 57
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Angie’s List, Indianapolis, IN, USA Sep, 2012 to March, 2014 Role: Senior Project Manager/Scrum Master Project Description:",
    "length": 123
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Angie's List is an American home services website.",
    "length": 50
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "It is an online directory that allows users to read and publish crowd-sourced reviews of local businesses and contractors.",
    "length": 122
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Formerly a subscription-only service, Angie's List added a free membership tier in July 2016 Responsibilities: Set up the entire Jira processes, boards, trainings.",
    "length": 163
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Trained the entire organization on Agile and Scrum.",
    "length": 51
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Agile Program management for 3 of their scrum teams which were spread across Indianapolis & Palo Alto in USA.",
    "length": 109
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Conducted monthly management meetings and helped then with metrics and analysis of all scrum teams with respect to schedule, delivery and quality/ Conducted all sprint ceremonies like Sprint Planning, daily stand up, reviews & retrospective meetings for all scrum teams Environment: C#, HTML5, CSS3, MS SQL Server 2010 Client:",
    "length": 326
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Serengeti Law a business of Thomson Reuters, Seattle, WA Dec 2010 –August 2012 Role: Senior Manager, Project Manager Project Description: Serengeti Intelligence System – Analytics Dashboards Serengeti Intelligence—a revolutionary way for law departments to easily access comparative and analytical information about your own performance—is ready to use within your Serengeti Tracker subscription at no additional charge.",
    "length": 420
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "And, we do it right in the context of your matters, invoices, and workflows.",
    "length": 76
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "mailto:Prasanna@intellyk.com",
    "length": 28
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Email Id: Prasanna@intellyk.com Contact # 732-399-9510 ext. 108 RAVI PATTAR Senior Agile Program Manager/ Certified Scrum Master/ Certified PMP Manager Financial – Compare your spending and risk data against similarly situated law departments to give you insights into your performance Operational – Assess the efficiency of your law department operations and management Firm – Evaluate your law firm portfolio and the performance of your law firms Evaluator – Improve analysis of law firm rates, rate increases, discounts and how your company’s bottom line is affected Responsibilities:",
    "length": 587
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Preparing and maintaining project Management Plan.",
    "length": 50
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Managing the schedule and quality of the deliverables through day-to-day planning, tracking and monitoring of the project.",
    "length": 122
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Triaging and prioritizing the requirements with the designated Serengeti project/product Manager.",
    "length": 97
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Handling Estimations, Project Planning & Tracking",
    "length": 49
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Maintaining Quality Standards Interaction with the client and coordinating offshore activities.",
    "length": 95
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Maintaining billing & other finance details of the project Data analysis, RCA, CAPA & Reporting Risk Management Conducting Monthly and Quarterly Business reviews",
    "length": 161
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Building Proposals, SOW and working on Presales.",
    "length": 48
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Resource Management Environment: ASP.NET, SQL Server 2008, SSIS, SSAS, SSRS, XML Projects managed and delivered between Jan 2009 – July 2007 at Aditi Technologies as PROJECT MANAGER Client Name Duration Product Name Technology Upside, Edmonton, CANADA Jan 2009 –Dec 2010 Contract Life cycle Management VB.NET, SQL Server 2005, SSIS, SSRS, XML, XSLT, InfoPath FileTek, USA July2007– Mar 2008 Trusted Edge VB.NET, SQL Server 2005, C++, MS SharePoint server 2005 Caselle Inc Sep 2007 –Jan 09 Caselle Clarity Suite VB.NET, SQL Server 2005",
    "length": 534
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Premise Inc Aug 2008 –Oct 2008",
    "length": 30
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Premise BI SSAS,SSIS,SSRS Client: Datacard Software India Pvt Ltd, Bangalore Jan 2003 – July 2007 Role: Java Developer, Performance Engineer, Lead in Java based Product Title : Affina – Smart Cards Life Cycle Managing System Client: Infosys Technologies Pvt Ltd, Bangalore August 2002 to January 2003 Role: Software Automation Test Engineer Project Title : CAMPUS PIPELINE Environment : RTM Rational Robot, Clear Quest, and CP Table Builder.",
    "length": 441
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Client:",
    "length": 7
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "Webwavez Technologies, Bangalore July 2000 to July 2002 Role: Software Engineer mailto:Prasanna@intellyk.com Email Id: Prasanna@intellyk.com Contact # 732-399-9510 ext. 108 RAVI PATTAR Senior Agile Program Manager/ Certified Scrum Master/ Certified PMP Manager Environment: Java Servlets, JSP, MSSQL, JavaScript ACHIEVEMENTS: Best Program Manager award from Client (Angie’s List – 2013) CEO, Aditi appreciations for contributions towards a Business Initiative in 2012.",
    "length": 468
  },
  {
    "file": "Ravi Pattar- Sr. Agile Program manager.pdf",
    "sentence": "“Best Mechanized Project” for a project Aditi Technologies, Bangalore ~“Best Performer” award in Aditi Technologies, Bangalore ‘‘Most Significant Contributor’ (For EP3R1.1 release) award at Datacard Software India Pvt Ltd, Bangalore mailto:Prasanna@intellyk.com",
    "length": 261
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Tarun Nalluri Sr. Java/Python Developer Phone: (802) 768-1105 E mail: nalluri.t01@gmail.com Professional Summary: 10+ years of IT experience that include deployment of java/j2eeapplications, tune up, performance optimization, troubleshoot, make decisions, data process, code review and documentation.",
    "length": 300
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Experience in client/server and distributed (multi-tier)Oracle Web Commerce, ATG BCC, CSC, ATG Endeca, Jboss, Weblogic & WebSphere applications, their development, maintenance and administration in different UNIX, Linux and Windows platforms",
    "length": 241
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Having Domain Experience in Finance, Accounting, Banking Telecom, Health Care, Airlines and E- Commerce.",
    "length": 104
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Involve in designing, developing, Installing and Configuring, Administering and Tuning and Troubleshooting Java/J2EE applications such as JBoss, IBM WebSphere (Application, Portal, Process, MQ)",
    "length": 193
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Tivoli, ND clusters 7.x/6.1/5.X,Weblogic, Web servers (HTTP Servers, web services, Tomcat Apache) all on cluster (vertical & horizontal).",
    "length": 137
  },
  {
    "file": "Tarun.pdf",
    "sentence": "With Functional expertise on Web Application & Desktop Application, CRM Applications.",
    "length": 85
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Experience on Oracle-Endeca Experience Manager, Operational and Search tuning, creating and maintaining Endeca page templates and cartridges.",
    "length": 141
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Also familiar with DevOps concepts.",
    "length": 35
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Sound experience comprising of Software Configuration Management (SCM) & Development.",
    "length": 85
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Extensive experience includes SCM, Build/Release Management, Change/Incident Management, VMware and AWS Cloud computing",
    "length": 119
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Worked on creating page layouts using Commerce Composer. .",
    "length": 58
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Cloud based deployment experience on Amazon EC2 and their other offerings like S3 and AWS Experienced in installing, configuring, and administrating Hadoop cluster of major Hadoop distributions, 2.5+ Fyears of experience with Hadoop, HDFS, Map Reduce and Hadoop Ecosystem (Pig & Hive).",
    "length": 285
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Experienced at Software Development Life Cycles and Agile Programming Methodologies.",
    "length": 84
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Good knowledge on Hudson and Jenkins for continuous integration and for End to End automation for all build and deployments.",
    "length": 124
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Extensively worked on setting up enterprise monitoring tools like Zabbix, AppDynamics, Graphite",
    "length": 95
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Expert in deploying the code through web application servers like Web Sphere/Web Logic/ Apache Tomcat/JBOSS.",
    "length": 108
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Hands on experience in installing, configuring and using ecosystem components like Hadoop MapReduce, HDFS, Sqoop, Pig, Hive and pig commands.",
    "length": 141
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Strong understanding of Zoo Keeper, Cassandra & Flume to the existing Hadoop cluster on linux and HD Insight on windows Exposure to OOA&D methodologies like waterfall model.",
    "length": 173
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Knowledgeable in creating various project artefacts like use-case documents, class diagrams, design document, architecture document, etc.",
    "length": 137
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Experienced in Object Oriented Analysis and Object Oriented Design using Unified Modelling Language (UML) and in Design Methodologies like MVC, DAO, OOP, and OOD",
    "length": 161
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Good skills in Java Multithreading, Exception Handling, J2EE, JSP, Servlets, JDBC, EJB, PHP,Custom Tag Libraries, Java Script, AJAX, CSS, HTML5, Struts, Spring, Hibernate, Enterprise Java Beans, JDBC, RMI, ESB,JNDI, XML XSD, XSLT, (DOM, SAX), SOAP, WSDL, JSON, JQuery, Java Script, CSS and Page 1 HTML, , LDAP,Web Services related technologies using AXIS.",
    "length": 355
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Proficiency in back-end procedure development, for RDBMS, Database Applications using Oracle, DB2, SQL and PL/SQL, SQL Server.",
    "length": 126
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Hands on experience on writing Queries, Stored procedures, Functions and Triggers by using PL/SQL.",
    "length": 98
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Strong understanding and experience in automation and configuration management tools(Rundeck,chef, Puppet)andContinuous Integration/Delivery solutions (Jenkins,Hudson)",
    "length": 167
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Experience in version control system tools (Git, SVN, Clearcase).",
    "length": 65
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Extensively worked with Infrastructure as a Service (IaaS) environments using tool Chef.",
    "length": 88
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Managed environments DEV, QA, UAT and PROD for various releases and designed instance strategies.",
    "length": 97
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Well Adverse with the principles and best practices of Software Configuration Management (SCM) processes, which include compiling, packaging, deploying and Application configurations.",
    "length": 183
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Hands-on Experience of the J2EE Framework and its components as related to Java build, test, deployment and release management initiatives.. Exposure to Module development, Requirement Analysis, Functional Specification Documentation and interaction - onsite coordination with client.",
    "length": 284
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Monitoring and maintaining multiple Applications in different Environments.",
    "length": 75
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Extensive Experience in installation/migration/deployment of Enterprise Applications using dynmo admin, Endeca-workbench, BCC, WAS Admin Console, on a highly available, load balanced production environments.",
    "length": 207
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Strong analytical and problem solving skills, ability to quickly adapt to new environments, learn new technologies and meet deadlines.",
    "length": 134
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Technical Skills: Application s/ Web Servers / Database Server Oracle-ATG web commerce, Oracle Endeca search, IBM HTTP, Apache Tomcat , BEA WebLogic 7/8.1, IBM WebSphere 6.1, WebSphere Portal/ Process, MQ Series Manager, Tivoli Access Manager JBOSS, SQL Server , Oracle 9i/10g Java Technologies: JDK 1.7/1.6/1.5, J2EE, Scala,Java Mail, JMS, JDBC, JavaBeans, Servlets, JavaServer Pages, EJB, JNDI, Applets, Swing, RMI, MVC Framework, Webservices, JAX-WS, Spring, Struts, Hibernate, JSF, MDB, XML, XSLT, Mockiton, and JUnit.",
    "length": 522
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Other Languages PL/SQL,SQL UNIX/Linux Shell Scripts, Python, Ruby,PHP, JavaScript, XML.",
    "length": 87
  },
  {
    "file": "Tarun.pdf",
    "sentence": "ORM & Frameworks: Hibernate, MVC - Struts &Spring.",
    "length": 50
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Design Methodologies: Design Patterns, OOA/OOD, UML, RUP IDE: Eclipse, NetBeans, WSAD, jBuilder, RAD, Visual Studio Web & Xml Technologies: HTML 5, DHTML, CSS, JavaScript, AJAX, CMS, XML, XSLT and SOAP.",
    "length": 202
  },
  {
    "file": "Tarun.pdf",
    "sentence": "e-commerce: ATG Dynamo, ATG 9.x, ATG 10.x, ATG 11, Endeca, WebeSpherecommerce, Hybris BigData/ Hadoop Ecosystem NoSQL Database: Hadoop, MapReduce, HDFS, Mahout, Zookeeper, Hive, Pig, Sqoop, Flume, Oozie HDInsight, Hbase, MongoDB, Cassandra Database &Tools: RDBMS, Oracle 9i, MS SQL 2000, MySQL5.0, Oracle TOAD Operating Systems: Windows (NT,XP, 7, Vista, Server), Unix(AIX Sun solaris)/Linux (Redhat, Suse) Version Control: CVS2.0, Visual Source Safe (VSS),SVN Build Tools: Apache ant, Maven, Hudson, Jenkins, Chef, Puppet Software Development methodology: Waterfall model, Agile, Scrum, OOAD, UML, Design Patterns.",
    "length": 615
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Monit tools: Graphite, Monit.,Appdynamics.",
    "length": 42
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Rundeck., logstash, Appdynamics Page 2 Management tools: Jira, vtiger, Assrubutiors embla, Gemini, asana, Skybot Professional Experience Client Citibank Duration Nov 2014 – Till Date Client Location NYC, NY Role Sr Java/Python/Hadoop Developer Technology JDK 7, JSF 2.0, Prime faces 3.0, JPA 2.0, Hibernate 3.4, Oracle 11, ESB, Web logic, GIT, Maven ,HTML 5,Javascript and LOG4J, SOAP, Rest, AWS,J2EE, Maven, Informatica ,UNIX, Spring, SOAP, REST, Python Responsibility Incorporate in installing, deploying, and configuring java/JEE applications for ATG Commerce, CSC, fand Search/Endeca framework.",
    "length": 598
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Successfully build complex web-based application using in Oracle Web Commerce, 9.X and 10.X, 11.X BCC, Endeca search, Infrastructure implementation, Working with developer and designer to create eCommerce website Manage and update eCommerce stores with customized backend functionalities Coach team members and new hires on various eCommerce platforms, CRMs and productivity tools Build and Release Management Built application logic using Python 2.7.",
    "length": 451
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Have delegated in successful administer& troubleshoot various difficult project issues in,Jboss, Web logic and Endeca-ATG integration, BCC administration, Experience Manager, Workbench, dynmo admin, Operational, Search tuning and Infrastructure implementation solutions.",
    "length": 270
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Dashboard to keep User Open Conversation and task counts using Node.js and Cassandra Upgraded complete ESB environment from XS40 to XG45, XI50 to XI52 firmware and hardware versions.",
    "length": 182
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Experienced with Data Extraction, Transformation and Loading using ETL tools like Informatica 8x, 9x and Bancware",
    "length": 113
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Architecting complex SOA applications with ESB frameworks Configured mongo clusters on red hat, have complete understanding on mongodb CRUD, indexing, replication and sharding techniques.",
    "length": 187
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Also have past experience on DBA functions.",
    "length": 43
  },
  {
    "file": "Tarun.pdf",
    "sentence": "used Groovy scripting to incorporate complex logic not possible through boomi interface.",
    "length": 88
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Designed and Developed Web and REST services integration through Datapower ESB for various applications running on Mainframe, WAS, WPS, WMB Build and release software baselines, code merges, branch and label creation and interfaced between development and infrastructure.",
    "length": 271
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Performed all necessary day-to-day Subversion support for different projects.",
    "length": 77
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Hands on experience with Spark-Scala programming with good knowledge Experienced Hadoop Developer has a strong background with file distribution systems in a big- data arena.",
    "length": 174
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Understands the complex processing needs of big data and has experience Page 3 developing codes and modules to address those needs.",
    "length": 131
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Design the J2EE components of the RestFul Web Services and scheduled Java batch jobs based application in UML.",
    "length": 110
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Used existing Deal Model in Python to inherit and create object data structure for regulatory reporting.",
    "length": 104
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Expert knowledge on mongodb no sql data modeling, tuning, disaster recovery and backup Experienced on Java/scala object-oriented programming language",
    "length": 149
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Providing a responsive, AJAX-driven design using JavaScript libraries such as jQuery, AngularJS, Backbone.js and Bootstrap.js - Using Subversion (SVN) for version control.",
    "length": 171
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Worked on Node.js and Socket.io for developing a chat application.",
    "length": 66
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Added a script to find fixed tickets for the Akka repository using shell scripting, and converted Akkaclasses to use new functionalities over deprecated functionalities",
    "length": 168
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Effectively used GIT(version control) to collaborate with the Akka team members Expertise in designing and developing applications using J2EE technologies including Servlets, JSP, EJB, JMS, Struts, Hibernate, Web Services, XML, JNDI, JDBC, CVS, Maven, HTML, CSS and JavaScript.",
    "length": 277
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Hands-on experience with Hadoop applications (such as administration, configuration management, monitoring, debugging, and performance tuning).",
    "length": 143
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Resolve, tune, maintain &manage client’s Jboss / weblogic / WAS – ATG instances on cluster connectivity producing optimal performance results in each environment throughout the life cycle.",
    "length": 188
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Building and monitoring in the project has been done continuously with a CI Tools like Jenkins.",
    "length": 95
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Deployment of the Business processes by creating JAR, WAR and EAR files to J2EE application servers.",
    "length": 100
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Used build tools on java projects for the development of build artifacts on the source code.",
    "length": 92
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Worked on install & Configure (Zabbix, Graphite, App Dynamics) agents as enterprise monitoring tool on windows and Linux operating systems.",
    "length": 139
  },
  {
    "file": "Tarun.pdf",
    "sentence": "In depth exposure to creating API for internal and external application using REST and SOAP based design.",
    "length": 105
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Open source framework like Jersey used for create REST API.",
    "length": 59
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Also worked as a system administrator for the build and deployments process on the enterprise server.",
    "length": 101
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Developed, maintained, and distributed release notes for each scheduled release.",
    "length": 80
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Implemented scripts for doing Cron jobs, wrote cookbooks (recipes) for all applications to manage the configuration files and to manage them as services.",
    "length": 153
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Created views and appropriate meta-data, performed merges, and executed builds on a pool of dedicated build machines.",
    "length": 117
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Hands on experience implementing Apache Spark or Spark Streaming project, preferably using Scala, and Spark SQL Developed applications using TDD and Clean Code principles in an Agile environment; Java 1.6/1.8, Spring, Web Services (REST and SOAP), XML, Oracle, SQL, and Hibernate in a relational database design Designed workflows, screens, field configurations and components as part of Projects definition for JIRA as an administrator.",
    "length": 437
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Used Ajax and JavaScript to handle asynchronous request, CSS to handle look and feel of the application.",
    "length": 104
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Experience in AWS cloud design, Architect, implement, and consultancy.",
    "length": 70
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Involved in periodic archiving and storage of the source code for disaster recovery.",
    "length": 84
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Used Atlassian JIRA &vtiger as ticketing tool.",
    "length": 46
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Page 4 Involved in week production window, on monthly on-call support.",
    "length": 70
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Working on Namenode high availability customizing Zookeeper Services",
    "length": 68
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Collaborate with zookeeper on weekly habitat construction and maintenance tasks which include handling.",
    "length": 103
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Daily routine is to deploy the code to the lower environments, automating the deployments.",
    "length": 90
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Implemented Subversion branching, merging operations for Java Source Code and tweak if changes in the requirements.",
    "length": 115
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Created a demo website running on a Node.js, using the Express framework, Jade, and Backbone.js with Mustache.js for front end MVC/ templating.",
    "length": 143
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Worked with the Automation Team to Automate the Windows and Linux Deployments.",
    "length": 78
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Configured Jenkins daily periodic backups for Jenkins config and plugins files.",
    "length": 79
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Integrated Jenkins Build pipeline plugin for managing multi project jobs efficiently.",
    "length": 85
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Customizing ATG Commerce and Merchandizing modules including customizing Catalog, Product display, Pricing, Coupon, Promotions, Cart, Checkout, fulfillment and inventory management.",
    "length": 181
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Proficient MDEX engines creation, failovers on multi-clustered environment",
    "length": 74
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Resolved numerous configuration issues with Apache, tomcat, plugins & add-on tools like Akamai Caching.",
    "length": 103
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Document Root Cause Analysis for all High Severity issues and present the same to clients Participate in high level team discussions in understanding of Networking Technologies like Load balancer(F5), Firewall, VIP, DNS.",
    "length": 220
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Experience in Bootstrap (responsive design), Backbone, and Angular JS frameworks.",
    "length": 81
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Quick Response to any given technical situation that requires immediate attention to ensure maximum system availability for supported commerce or middleware instances",
    "length": 166
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Sole in charge for Endeca performance tuning, migration, pipeline, cartridges, and templets using scripts and implement various metrics that can statistically signify the success.",
    "length": 179
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Strong understanding and knowledge of Linux, automation and CI Tools like Chef, Hudson, Jenkins & Git with scripting languages (Shell, python, pearl and ruby).",
    "length": 159
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Efficient, cost effective, secure, and scalable AWS cloud design based on business requirements.",
    "length": 96
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Provided periodic feedback of status and scheduling issues to the management for change management, production support.",
    "length": 119
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Represent, correspond & coordinate, organize meetings like- incident management, change management (CAB), Build and Release management, PCI.",
    "length": 140
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Client McKesson Health Solutions Duration Jan 2012 -Oct 2014 Client Location Rochester, MN Role Sr Java/Hadoop/Python developer Technology JDK 7, JSF 2.0, Prime faces 3.0, JPA 2.0, Hibernate 3.4, Oracle 11, GIT, Maven and LOG4J, SOAP, Rest, J2EE, Maven,AWS, UNIX, Spring, SOAP, REST,microservices Responsibility",
    "length": 311
  },
  {
    "file": "Tarun.pdf",
    "sentence": "This web-based application was built using agile development practices using Extreme Programming.",
    "length": 97
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Responsible in Installing, Configuring and Trouble-Shooting IBM Web Sphere Application Server, Network Deployment) and Web Servers like IBM HTTP Server, IBM Web Sphere MQ 5.3, 6.0, IBM Web Sphere Message Broker 6.1",
    "length": 214
  },
  {
    "file": "Tarun.pdf",
    "sentence": ", Sun One Web Server on Linux, Solaris, AIX Page 5 and Windows platforms.",
    "length": 73
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Expertise in using cloud services (AWS) EC2, S3 Storage, Kinesis for multiple Big Data PoC's Designed and developed software applications using Java, Multithreading, Servlet, AngularJS, Bootstrap 3, JSP, JSTL, HTML, JavaScript, Groovy, Grails, EJB, JMS, XML, XSL, JSF, Ajax, JQuery, Adobe Flex 3, GWT, ADF etc.",
    "length": 310
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Developed back-end using RESTful Web Services, Spring, Hibernate, Oracle and Groovy/Grails script with Java code.",
    "length": 113
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Wrote controllers with Groovy to connect front-end interfaces with java services on Grails framework Developed RESTful web services interface to Java-based runtime engine and accounts.",
    "length": 184
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Was also involved in migrating Web Sphere applications from 5.x to 6.0 and 6.1x on various operating systems of UNIX (Solaris/AIX/Linux) and Windows.",
    "length": 149
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Responsible for developing data pipeline using Hadoop ecosystem to extract the data from weblogs and store in HDFS.",
    "length": 115
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Worked extensively on the Python based proprietary framework Quartz.",
    "length": 68
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Created a Rich Single Page Application using HTML, CSS, Angular js, JQuery , SOAP and REST Services.",
    "length": 100
  },
  {
    "file": "Tarun.pdf",
    "sentence": "In-depth understanding of Map Reduce and the Hadoop Infrastructure.",
    "length": 67
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Developed internal application using Angular.js and Node.js connecting to Oracle on the backend.",
    "length": 96
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Standardized backup and restore practices for Mongo / Cassandra Installed & configured MMS for Mongo production databases Used various tools to test the REST based web services Used Spark to create API’s in JAVA and Scala for Big data analysis.",
    "length": 244
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Migration of Existing Application to AWS cloud Excellent performance and scalability by integrating Datastax Cassandra Created and Implemented Restful Web Services to provide the interface to the various clients running on both Java and Non Java applications",
    "length": 258
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Worked on Performance tuning on Spark Application.",
    "length": 50
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Designed, developed, implemented, and maintained custom Ant tasks in Java and Groovy.",
    "length": 85
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Implemented dual security application using Java/Groovy/Grails that eradicates the hazard of compromised credentials during authentication.",
    "length": 139
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Developed and executed software systems utilizing JavaScript and Groovy.",
    "length": 72
  },
  {
    "file": "Tarun.pdf",
    "sentence": "SDesigned and developed Groovy Grails applications for end users.",
    "length": 65
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Developed an automation tool, in Java and Scala on Akka framework, to allow Aspect’s customers to provide a background load of agent traffic on the system, while they perform functional testing on the real clients",
    "length": 213
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Excellent performance and scalability by integrating Datastax Cassandra",
    "length": 71
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Served as the sole Web Sphere Administrator for development team.",
    "length": 65
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Deployed and configured java based applications with clear understanding of firewalls and ports used to ensure application connections with back-end systems and front-end configurations of IHS Designed, implemented and tested the Spring Domain Model for the services using Core Java.",
    "length": 283
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Developed presentation layer using JSP, HTML, DHTML, CSS, AJAX, JavaScript, and JSTL Taglibs.",
    "length": 93
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Involved in implementation of application using conventional design practices (Web-Service Oriented Architecture, MVC-Model View Controller).",
    "length": 141
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Developed the presentation layer using CSS and HTML taken from Bootstrap to develop for multiple browsers including mobiles and tablets.",
    "length": 136
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Good experience with Python, Pig, Sqoop, Oozie, Hadoop Streaming and Hive.",
    "length": 74
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Page 6",
    "length": 6
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Integrated springs framework with Hibernate that is used for Database operations.",
    "length": 81
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Collaborated on design spec reviews together with Business Analysts Involved in web component design and development using the spring framework, JSP, Servlets, and taglibs.",
    "length": 172
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Hands on experience in installing, configuring and using ecosystem components like Hadoop Map Reduce, HDFS, Sqoop, Pig & Hive.",
    "length": 126
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Provided complete infrastructure solutions for public cloud services like AWS, Rackspace and digitalOcean etc.",
    "length": 110
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Extract Real time feed using Kafka and Spark Streaming Worked on the modernization of a legacy and outsourced UI.",
    "length": 113
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Technologies used were Angularjs, Backbonejs, Node.js and JQuery.",
    "length": 65
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Developed a prototype of a MASHUP where back end is JAX-RS (Jersey) REST and SOAP webservice and front end is UI developed using Bootstrap.js, Angular.js. Involved in loading and storing objects using Hibernate and in configuring mapping file.",
    "length": 243
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Provided periodic feedback of status and scheduling issues to the management.",
    "length": 77
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Publish and Consume Contract First SOAP web services using spring & Restful Web services using Jersey.",
    "length": 102
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Client Oracle Retail Group Duration Nov2010 - Dec 2012 Client Location San Francisco, CA Role Sr Java /PythonDeveloper Technology WebSphere Application Server, Apache Server, Eclipse, Oracle database, Core Java,DB2,OBIEE,Unix AIX, Sun Solaris, Linux, Shell script, Web service and Agile Development Responsibility Multi-channel system for originating and processing a full range of finance applications",
    "length": 402
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Experience in middleware infrastructure configuration, migration and administration.",
    "length": 84
  },
  {
    "file": "Tarun.pdf",
    "sentence": "As part of distributed middleware team (DSMT), helped in several internal clients with planning, design, configuration and migration of their WebSphere servers & Deployment Manager Topologies.",
    "length": 192
  },
  {
    "file": "Tarun.pdf",
    "sentence": "UIS system design (Python Object Oriented Design approach, developing various modules/packages/utilities, e.g.: Cryptography - Encryption/Hashing, Foundation Utilities, Persona management, error/exception management etc.).",
    "length": 222
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Involves installation, configure, administer and support Network Deployment Manager, Nodes and Application Servers.",
    "length": 115
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Federated multiple WebSphere Application server 6.x, 5.x, 4.x, IBM HTTP Server 1.3.x, 2.0.x, 6.x, IBM WebSphere MQ 5.3, 6.0, nodes to the Deployment Manager on Unix (AIX) and Linux environments.",
    "length": 194
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Developed Unit and E2E test cases using Node JS.",
    "length": 48
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Created and configured clusters of servers both vertical and horizontal on federated nodes for load balancing and failover using BigIp.",
    "length": 135
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Installed IBM Http Server and Apache web server and configured it with WebSphere Plug-ins to work with WebSphere Application Server.",
    "length": 132
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Installed IBM DB2 UDB 8.1.5 and catalogued the remote database server and database for db2 legacy type2 drivers.",
    "length": 112
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Built a RESTful API to save and retrieve using a remote server in Java using Spring, MongoDB, Apache CXF, and JAX-RS.",
    "length": 117
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Developer (RAD), Angular JS for Java/J2EE application development.",
    "length": 66
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Designed and developed the UI using Struts view component, JSP, HTML, CSS and Page 7 JavaScript. Developed Python Mapper and Reducer scripts",
    "length": 140
  },
  {
    "file": "Tarun.pdf",
    "sentence": "implemented them using Hadoop streaming.",
    "length": 40
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Created J2C authentication data entries for configured data source to test database connection from Web Sphere administrative console.",
    "length": 134
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Configured virtual hosts and transports for Web Sphere application servers.",
    "length": 75
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Configured SSL for IBM Http Server using Ikeyman utility provided with the Http Server.",
    "length": 87
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Applied fix packs and cumulative fix packs to upgrade the Web Sphere Application Server versions.",
    "length": 97
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Involved in trouble shooting application server, web server and plug-in logs and analyzed them using Log Analyzer in case of any critical issue.",
    "length": 144
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Monitored the performance of the deployed applications by enabling the Performance Monitoring Infrastructure (PMI) using Runtime Performance Advisor and Tivoli Performance Monitor.",
    "length": 180
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Actively monitoring of all the servers in production and staging environments and fixing any issues with the servers.",
    "length": 117
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Managed tasks and acted as point of contact for off-shore team coordination.",
    "length": 76
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Develop technical design documents UML, reverse engineering code Client AT&T Telecom Duration Mar 2007 – Nov 2010 Client Location NYC, NY Role Java Developer Technology JBoss Application Server, JBOSS DROOLS engine,JDeveloper, Struts,Core Java,Helix framework,Hibernate,DB2, EBI,PHP,Jquery, Agile Development, Oracle 9i/11i, Spring Responsibility",
    "length": 346
  },
  {
    "file": "Tarun.pdf",
    "sentence": "This web-based application was built using agile development practices using Extreme Programming.",
    "length": 97
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Participating in user requirement sessions to gather business requirements.",
    "length": 75
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Involved in Analysis, Design, Development, Integration and Testing of application modules.",
    "length": 90
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Participated in the design meetings and created class and sequence diagrams from the Design Documents for the modules assigned to me using UML.",
    "length": 143
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Implementing MVC Architecture using Spring Framework, customized user interfaces.",
    "length": 81
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Used Core Java, and Spring Aspect Oriented programming concepts for logging, security, error handling mechanism Developed user interface using JSP, AJAX, HTML, CSS, JSP Tag libraries to simplify the complexities of the application.",
    "length": 231
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Created SQL Map config files to create the sql queries, map the data and objects to retrieve data from the database using IBATIS.",
    "length": 129
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Injected objects using Spring dependency injection concepts Have worked on Oracle data base for storing and retrieving the application data Implemented procedures, packages, triggers, and different Joins to retrieve the data base using PL/SQL, SQL scripts.",
    "length": 256
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Created DDL, DML scripts to create tables and privileges on respective tables in the database.",
    "length": 94
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Creation of REST Web Services for the management of data using Apache CXF.",
    "length": 74
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Connected to Web Services applications using AXIS and integrated it with maven and Spring.",
    "length": 90
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Created a batched job which retrieves the records from the database and sends the data to the letter generating web service.",
    "length": 124
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Maven is used to create build file and does Unit testing by creating Test Suites using JUnit Framework.",
    "length": 103
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Page 8 Solving the issues found during the testing phase for all the modules that developed.",
    "length": 92
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Extensive troubleshooting and stress testing for the developed module and improved the performance of the application.",
    "length": 118
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Used Ajax and JavaScript to handle asynchronous request, CSS , HTML to handle look and feel of the application.",
    "length": 111
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Involved in code versioning, Check In, Check outs and code merging using SVN versioning tool.",
    "length": 93
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Used JBoss Drools Flow provides workflow or (business) process capabilities to the Drools platform.",
    "length": 99
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Involved in the integration of all the 3-tiers of the architecture consisting of Data service layer, Business Object layer and Presentation layer (front frameworks).",
    "length": 165
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Involved in the integration testing and made sure the data flows correctly from one sub system to another.",
    "length": 106
  },
  {
    "file": "Tarun.pdf",
    "sentence": "Page 9",
    "length": 6
  }
]